package com.example.l.wanshaapp.Rankingtools;


import com.example.l.wanshaapp.R;

/**
 * Created by 侯顺发 on 2018/5/24.
 */

public class FourFragmentTools {

    //图片资源
    public  static  int img[] = {
            R.drawable.rankinggood_01, R.drawable.rankinggood_02, R.drawable.rankinghot_17, R.drawable.rankinghot_11, R.drawable.rankinghot_10,
            R.drawable.rankinghot_20, R.drawable.rankinggood_07, R.drawable.rankinggood_08, R.drawable.rankinggood_09, R.drawable.rankinghot_16,
            R.drawable.rankinggood_11 , R.drawable.rankinggood_12 , R.drawable.rankinggood_13 ,R.drawable.rankinghot_09 , R.drawable.rankinghot_12 ,
            R.drawable.rankinghot_13, R.drawable.rankinggood_17 , R.drawable.rankinggood_18 , R.drawable.rankinggood_19 , R.drawable.rankinggood_20
    };
    public  static  int img1[]={
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star , R.drawable.star , R.drawable.star ,R.drawable.star , R.drawable.star,
            R.drawable.star , R.drawable.star ,R.drawable.star , R.drawable.star ,R.drawable.star  };
    public  static  int img5[]={
            R.drawable.halfstar, R.drawable.errostar, R.drawable.halfstar, R.drawable.errostar, R.drawable.halfstar,
            R.drawable.star, R.drawable.errostar, R.drawable.halfstar, R.drawable.halfstar, R.drawable.halfstar,
            R.drawable.halfstar , R.drawable.errostar , R.drawable.errostar,R.drawable.errostar,R.drawable.errostar,
            R.drawable.star,R.drawable.halfstar,R.drawable.halfstar,R.drawable.errostar,R.drawable.halfstar};
    //文字资源（游戏名）
    public  static   String title[]={
            "绝地求生：刺激战场","王者荣耀","牧羊人之心","第五人格","元气骑士",
            "崩坏3","碧蓝航线","虚荣（Vainglory）","命运-冠位指定", "炉石传说",
            "战箭天下","少女前线","香肠派对","月圆之夜", "万象物语",
            "绝地求生：全军出击","爆炒江湖","战斗天赋解析系统","阴阳师","幸存者危城"};
    public  static  String date[]={
            "吃鸡","多人对战","养成","逃生", "二次元",
            "Roguelike","高画质","二次元","二次元", "暴雪",
            "二次元","竞技","射击","养成", "吃鸡",
            "卡牌","经营","对战","卡牌","对战"};

    public  static  String date2[]={
            "绝地求生","MOBA","魔物娘","联机", "打击感",
            "像素","MOBA","美少女","卡牌养成", "CCG",
            "美少女","对战","多人","角色扮演", "绝地求生",
            "单机","放置","二次元","养成","日系"};

    public  static  String date3[]={
            "PUGB","联机","模拟经营","生存","美少女",
            "","点击MOBA","养成","厨向","策略",
            "养成","","联机","RPG","",
            "Rougelike","养成","日系","回合制","卡牌"};

    public  static  String  date5[]={
            "","","","CCG","",
            "","","","","",
            "","","生存","","",
            "","","美食","",""};

    public  static  String  data4[]={
            "8.5","8.2","8.7","8.2","8.6",
            "9.7","9.3","8.5","9.2","9.1",
            "9.3","7.1","7.8","8.3","8.5",
            "9.5","8.7","8.5","7.9","9.1"};

    public  static  String  data6[]={
            "大吉大利，今晚吃鸡","掌上竞技，随时开黑","魔物娘带你开启异世界之旅","给你的园丁来个公主抱吧",
            "别样的像素游戏", "氪金游戏，欧皇游戏","舰娘带你打天下","完美的MOBA游戏",
            "来一发Saber的咖喱棒吧", "暴雪出品，必属精品", "骑马射箭的快感和打击感","寻找铁血AI叛乱的真相",
            "外形搞怪但内核过硬的吃鸡游戏","最为经典的独立卡牌游戏", "森罗万象的视觉体验", "大吉大利，今晚吃鸡",
            "主线任务开放不断，成就无肝大师","多元结合，个性搭配","氪金大师，人非勿进","畅享末日游戏的快感"};


    public static String publisher[]={
            "成都天元开发工作室","谭氏游戏开发集团","咸鱼游戏研发工作室","牛气满满游戏工作室","顺发企业集团",
            "成都天元开发工作室","谭氏游戏开发集团","咸鱼游戏研发工作室","牛气满满游戏工作室","顺发企业集团",
            "成都天元开发工作室","谭氏游戏开发集团","咸鱼游戏研发工作室","牛气满满游戏工作室","顺发企业集团",
            "成都天元开发工作室","谭氏游戏开发集团","咸鱼游戏研发工作室","牛气满满游戏工作室","顺发企业集团"
    };
    public static  String shouchang[]={
            "收藏","收藏","收藏","收藏","收藏",
            "收藏","收藏","收藏","收藏","收藏",
            "收藏","收藏","收藏","收藏","收藏",
            "收藏","收藏","收藏","收藏","收藏"
    };

    public static  String xiangqingvideo[]={
            "http://sj.video.5054399.com/sjyx/jdqscjzcccaz/jdqscjzcccaz2.mp4",
            "http://sj.video.5054399.com/sjyx/wangzherongyaoan/wangzherongyao.mp4",
            "http://sj.video.5054399.com/sjyx/muyangrenzhixinaz/muyangrenzhixinaz.mp4",
            "http://sj.video.5054399.com/sjyx/di5rgaz/di5rgaz5.mp4",
            "http://sj.video.5054399.com/sjyx/yuanqiqishi/yuanqiqishi.mp4",
            "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""

    };


    public static  String download[]={
            "下载","下载","下载","下载","下载",
            "下载","下载","下载","下载","下载",
            "下载","下载","下载","下载","下载",
            "下载","下载","下载","下载","下载"
    };

    public  static  String xiangqingtext2[]={
            "大吉大利，今晚刺激！《绝地求生：刺激战场》作为绝地求生正版手游，完美还原端游的纯正游戏体验。\n",
            "《王者荣耀》是全球首款5V5英雄公平对战手游，腾讯MOBA手游大作！ 作为一款MOBA类游戏，《王者荣耀》特色多多，在同类的游戏中可谓是一枝独秀，艳压全场。",
            "【魔物娘收集与养成】\n" +
                    "从一个蛋开始培育自己独一无二的魔物娘，多达60余种不同魔物（不断添加中）在路上等待着您！\n" +
                    "【休闲的牧场建设】\n" +
                    "成为驯养师，建设自己专属的魔物牧场！自由建设+改造，多种风格随心搭配！\n",

            "“遗失的自我，无法踏入同一条河流”\n" +
                    "在庄园之旅中，诸位将扮演一位身份成谜的侦探，根据细枝末节的线索，从离奇的谜团中演绎出自己的探案之路\n" +
                    "——细致入微的剧情代入：以侦探视角抽丝剥茧，从简单上手，到还原一场场精彩的游戏对局\n",

            "特点：\n" +
                    "* 各种奇葩的英雄以及技能。\n" +
                    "* 大量独特的武器等你发现。\n" +
                    "* 随机生成的关卡，每次都有新体验。\n" +
                    "* 独特的NPC，可以与你并肩作战。\n" +
                    "* 自动瞄准功能，再也不怕手残。\n" +
                    "* 无数其他特点，玩玩就知道了！",

            "【天命之战】\n" +
                    "全体部队作战准备…集中所有火力，占领天命总部第三空港！\n" +
                    "逆天命而行，是为信仰之战。\n" +
                    "决绝的牺牲，无悔的托付…以及宿命的重逢。\n" +
                    "“就算变成律者，我也绝不会抛下你…就像你也从未抛弃过我一样！”",

            "《碧蓝航线》是一款集即时海战、少女养成及多种社交休闲玩法为一体的手游。由中日画师阵容倾力打造，超过150位性格各异萌点十足的小姐姐等待出击，为你而战！游戏采取双排式策略作战方式，配合即时战斗模式，真实还原海战临场感，带你体验全新的操作乐趣！",

            "欢迎来到虚荣。在这里，魔法与科技兵戎相见，风格各异的英雄们在战役中结盟，巧妙地运用超群的战术赢取胜利。但没有人是在孤军奋战。与您的朋友们一起加入这款免费的5V5多人竞技游戏吧！",

            "被誉为日本“蚁后级IP”的Fate系列首款正版手游《Fate/Grand Order》正式上线！《Fate/Grand Order》（中文译名《命运-冠位指定》，以下简称《FGO》）由TYPE-MOON出品，由bilibili游戏在大陆地区独家代理发行。\n",

            "勇敢的英雄请当心，你已踏入危险之地……《炉石传说》渡鸦年首个扩展包“女巫森林”现已上市！这一次，英雄们来到了吉尔尼斯城外的黑樟林，一片被女巫哈加莎诅咒的土地，他们要面对的，是前所未见的恐怖生物，和月光下的黑暗魔法。",

            "《战箭天下》（Battle Of Arrow），是一款1对1轻竞技对战手游。游戏以骑马射箭为题材，用户可真实地体验到手指滑动瞬间带来的快感以及强烈打击感。游戏以卡通的画风表现手法，在全三维空间中展开的1对1对决，每场战斗都能为您奉献逼真体验和紧张之感。",

            "首款国人原创军武枪娘题材卡牌手游！M4A1、AK47...百款枪娘集结完毕，多元养成造就前线尖兵！策略部署多线推进、小队战术即时操作，携手少女寻找铁血叛乱真相，完成不曾放弃的誓约！",

            "外形搞怪但内核过硬的荒岛特训吃鸡手游。\n" +
                    "\n" +
                    "64km²的大地图，有城镇，有野点，有树丛，有草丛，每局支持100名玩家对战。\n" +
                    "\n" +
                    "超硬核射击体验，逼真的后坐力算法，真实的弹道物理计算。",

            "* 一款独立单机游戏\n" +
                    "* 轻度策略卡牌战斗\n" +
                    "* 随机事件探索与冒险\n"+
                    "* 五种职业、四百多张卡牌自由搭配\n" +
                    "* 八十二位神秘莫测的对手等待你的挑战\n" +
                    "* 探险过程中随机触发未知事件\n",

            "顶级手游大厂雷亚诚意之作\n" +
                    "\n" +
                    "《万象物语》是台湾著名手游厂商雷亚历时四年精心打造的收款角色扮演游戏。此前雷亚皆以音乐游戏广为人知，《万象物语》则是其在首个动作手游《聚爆》取得成功后在角色扮演领域展开的新的尝试。游戏保持了雷亚游戏一贯的超高水准，每一个要素都力求完美，在将音乐元素与游戏画面结合的丰富经验基础上，通过引人入胜的丰富剧情及匠心打造的视觉盛宴，期望带给玩家最极致的游戏体验。",

            "本作为腾讯天美工作室群与韩国蓝洞共同推出的《绝地求生》官方正版虚幻4引擎手游。",

            "短小精干，每天只需一分钟收个菜。\n" +
                    "养成Play，随手又抽到个漂亮厨娘！\n" +
                    "实力卖萌，客人是猴子派来的逗比……\n" +
                    "没有互动，不给任何人虐狗的机会~\n" +
                    "收集福音，满汉全席也只是小Case",

            "「战斗天赋解析系统」是一款集合社交功能的对战游戏，玩家在战斗的同时也可以在游戏中进行交流互动，新朋友以及白热化的对战在这里等着你！\n",

            "★ 百鬼绮谭：精彩绝伦的剧情，刻画细腻的角色\n" +
                    "★ 真实社交：方圆之内寻好友，游戏之外亦作伴\n" +
                    "★ 绚丽画卷：优美的京都风光，与友人携手同赏\n" +
                    "★ 听觉盛宴：顶级声优配音，梅林茂亲创原声",

            "若你身处末日，丧尸充满了整个城市，食物，武器都需要自己寻找。你唯一能做的就是尽可能的活下去，并且想尽办法逃出这座城市。"

    };

    public  static  String xiangqingtext4[]={
            "【新模式、新玩法】\n" +
                    "1、新增娱乐模式“战争模式”，限时开启，10级可进入；此模式开局可随机获得一种武器，被击败后可重新跳伞加入战斗，以队伍积分为胜利条件；\n" +
                    "2、“战争模式”开启时间：周一至周五18点~次日1点；周六、周日12点~次日1点；（时间变动以游戏内为准）\n" +
                    "\n" +
                    "【新增系统】\n" +
                    "3、新增“表情动作系统”，更新后玩家将获得表情动作；在大厅和战斗内，角色可以使用各种表情动作；\n" +
                    "4、新增“绝地战区”系统，该系统基于玩家的地理位置进行区域排名，玩家可以在此系统查看自己的地域排行榜称号；\n" +
                    "5、新增“好友观战”，玩家可以选择观战正在战斗中的好友对局；\n" +
                    "6、新增使用自由镜头时，角色会跟随镜头朝向而转动头部朝向；\n" +
                    "\n" +
                    "【更新枪械】\n" +
                    "7、新增SLR精确射手步枪，该枪使用7.62子弹；\n" +
                    "8、新增轻型握把、半截式握把、拇指握把；\n" +
                    "9、新增3倍镜，6倍镜；6倍镜可在3倍~6倍之间进行缩放；\n" +
                    "10、【自动步枪】现在改称【突击步枪】;【连发狙】现在改称【精确射手步枪】；\n" +
                    "11、支持在射手步枪上装配步枪枪口、弹匣配件；\n" +
                    "12、支持在短管霰弹枪装配霰弹枪收束器；\n" +
                    "13、8倍镜将不能在突击步枪、S12K、M249上装备\n" +
                    "\n" +
                    "【其他优化】\n" +
                    "14、解决了iPhone6/6P频繁闪退问题；\n" +
                    "15、“破片手榴弹”新增了命中效果和动画；“破片手榴弹”现在可以将载具炸开；\n" +
                    "16、重量调整\n" +
                    "a)破片手榴弹:从12调整为18\n" +
                    "b)燃烧瓶: 从18调整为16\n" +
                    "c)烟雾弹: 从16调整为14\n" +
                    "d)震爆弹: 从14调整为12\n" +
                    "17、药品调整\n" +
                    "a)肾上腺素现在以极低的概率在地图中刷新\n" +
                    "b)肾上腺素的使用时间从8秒调整为6秒\n" +
                    "18、枪械平衡性调整：\n" +
                    "a)略微提高了冲锋枪、手枪、狙击枪、精确射手步枪（除SKS）的伤害\n" +
                    "b)略微提高了冲锋枪、霰弹枪对四肢、手部、脚部的伤害系数\n" +
                    "c)略微加快了冲锋枪的换弹速度，减慢了突击步枪的换弹速度\n" +
                    "19、优化了好友列表逻辑，修复了当平台好友过多导致的数据异常问题；\n" +
                    "20、分解系统增加批量分解功能；\n" +
                    "21、娱乐模式中，小地图打开后会自动放大到安全区；\n" +
                    "22、历史战绩中增加举报按钮；\n" +
                    "23、优化观战表现，在观战中增加当前武器以及人物状态信息的显示\n" +
                    "24、空油量时提示一键加油；\n" +
                    "25、操作自定义支持配置：自动疾跑按钮和拾取列表位置；同时自定义按钮可以放得更大；\n" +
                    "\n" +
                    "【BUG修复】\n" +
                    "26、修复已知卡地形的bug；\n" +
                    "27、修复探头移动卡加速的bug；\n" +
                    "28、烟雾弹卡飞天的bug；\n" +
                    "29、修复第一人称下顶墙跳拳可以透视墙体的bug；\n" +
                    "30、修复其他若干已知bug；" ,

            "5V5王者峡谷、5V5深渊大乱斗、以及3V3、1V1等多样模式一键体验，热血竞技尽享快感！海量英雄随心选择，精妙配合默契作战！10秒实时跨区匹配，与好友组队登顶最强王者！操作简单易上手，一血、五杀、超神，还原经典体验！实力操作公平对战，回归MOBA初心！ \n" +
                    "特色一：5v5！越塔强杀！超神！\n" +
                    "5V5经典地图，三路推塔，呈现最原汁原味的对战体验。英雄策略搭配，组建最强阵容，默契配合极限666！\n" +
                    "特色二：随时开团！10分钟爽一把！\n" +
                    "最适合手机的MOBA游戏，10分钟享受竞技体验。打野迂回，手脑配合，一战到底！人多，速来！\n" +
                    "特色三：公平竞技！好玩不坑拼实力！\n" +
                    "凭实力carry全场，靠技术决定胜负。不做养成，不设体力，还你最初的游戏乐趣！\n" +
                    "特色四：指尖超神！风骚走位秀操作！\n" +
                    "微操改变战局！手速流？意识流？看我风骚走位，力压群雄，打出钻石操作！收割，连杀超神！\n" +
                    "特色五：手机开黑！跨服匹配就是干！\n" +
                    "掌上竞技，随时开黑，一次玩个痛快！亿万玩家同时匹配，跨区实战酣畅淋漓，争夺王者宝座！",

            "卡露蒂亚•朵阿贝，“牧羊人之心”，在这片广袤大地上生营的人类先祖语言中，它是“家”的象征，是的，卡露蒂亚，就是这块大陆的名字。这里，魔物和人类共同生活。\n" +
                    "“我会成为最厉害的驯养师！”\n" +
                    "少年和少女从此踏上旅途~\n" +
                    "\n",

            "《第五人格》是网易首款非对称性对抗竞技手游。荒诞哥特画风，悬疑烧脑剧情，刺激的1V4对抗玩法，都将给玩家带来全新的游戏体验。玩家将扮演侦探奥尔菲斯，在收到一封神秘的委托信后，进入恶名昭著的庄园调查一件失踪案。在进行证据调查过程中，玩家扮演的奥尔菲斯将采用演绎法，对案情进行回顾。在案情回顾时，玩家可以选择扮演监管者或求生者，展开激烈的对抗。而在调查的过程，无限接近事实时，却发现越来越不可思议的真相。\n",

            "“世界危在旦夕，时间处于剑与魔法的时代，维持世界平衡的魔法石被拥有高科技的外星生物夺走了，你能否夺回魔法石拯救这个世界？”\n" +
                    "\n" +
                    "故事我们实在编不下去了，就是想做一个丧心病狂打怪兽的游戏！\n" +
                    "\n" +
                    "我们相信这就是你潜意识中一直渴望的那个游戏！探索地牢，收集各种奇异的武器，然后丧心病的战爆小怪兽！超级简单，超级直觉的操作，流畅又有趣的游戏体验，外加一些rogue-like元素，至今手机上能找到的最好的射击游戏。",

            "美术品质为同类游戏的佼佼者，视觉包装为业界典范。\n" +
                    "——许慕典《光影对决》制作人\n" +
                    "\n" +
                    "只看一眼就被征服。\n" +
                    "——邓梁 游戏葡萄主编\n" +
                    "\n" +
                    "其美术和动画效果在国内手游中堪称高水准。\n" +
                    "——楚云帆 游研社创始人\n" +
                    "\n" +
                    "「崩坏3」点燃ACG动作之魂! 次世代的动作游戏出击！——教科书式的3D全视角卡通渲染、蜜汁沉浸的关卡剧情、熟练可调戏的看板萌妹、无限可能的分支连招，以及不科学的超强打击感！作为天朝原创IP大作，更有中日人气声优献声哟~！撒，与女武神并肩作战，一起抵抗「崩坏」吧！\n" +
                    "\n" +
                    "PS：为了社区的环境，请将邀请码分享到版区专帖：https://www.taptap.com/topic/60227\n" +
                    "崩坏3官网&TapTap通兑礼包码：EUSPDS5T97，请在游戏内兑换使用（礼包码与官方微信号领取的“爱酱的零花钱”属于同一批，每个玩家只能使用一次，安卓和iOS版都可以使用）",

            "--即时海战，感受充满张力的临场感！\n" +
                    "从最细微的惯性系统到爽快的全弹射击，从规避致命伤害到予以敌方痛击，让指挥官们如同置身瞬息万变的战场上，运用精妙的策略搭配和灵活的操作，在遮天蔽日的炮火中为人类的未来开辟新的道路！\n" +
                    "\n" +
                    "--强大的中日画师阵容，塑造各色魅力少女！\n" +
                    "汇聚了中日画师团队。御姐、萝莉、邻家少女……超过150名性格萌点各异的小姐姐！ 静待指挥官您的命令！\n" +
                    "\n" +
                    "--养成与收集 丰富要素等你发掘！\n" +
                    "丰富有趣的后宅系统，数百种家具随意DIY，打造属于指挥官与少女们的乐园；特有的手办收藏系统，让小姐姐们填满属于自己的手办柜吧！\n" +
                    "\n" +
                    "--最激烈的PVP，争夺无敌舰队之名！\n" +
                    "陷身历史与战火的齿轮，与其他指挥官实时交锋，改变世界格局！证明自己的时候到了！\n" +
                    "\n" +
                    "--超豪华声优阵容（排名不分先后）！\n" +
                    "上坂堇、雨宫天、堀江由衣、田中敦子、茅野爱衣、福原綾香、山本希望、篠田南、大地叶、桥本千波、优木加奈、加隈亚衣、桑原由气、长绳麻理亚、阿部里果、白壁爽子、河野洋美、横田彩、吉冈香织、山根希美、石川由依、五十岚裕美、篠原成美、御手洗果林、中条智世、佐仓绫音、佐久间比吕美、Maia。\n",

            " - 适用于大众的休闲赛，以及能力要求更高的排位赛。 - 超过37位英雄正等待与您相识，新英雄仍在不断增加中 - 收集卡片解锁英雄皮肤，收集‘阳光’获得专属奖励。 - 专为移动平台打造的超精度触控操作 - 超细腻完美游戏画质，无与伦比的震撼世界 - 深层次战略游戏，百玩不厌 - 与真实玩家或AI机器人进行实时对战 - 既可与好友组队，也可在旁观模式中进行观战。 - 由E.V.I.L.引擎提供技术支持（每秒60帧，最多30毫秒延迟的超精度触控反馈） - 在 Twitter ，Twitch 及 Reddit 上拥有活跃的深度社区\n" +
                    "“这是移动设备上最好的多人游戏之一。虚荣（Vainglory）是一款堪称完美的MOBA游戏，您可以使用掌上移动设备随时随地进行游戏。”－IGN",

            "【Fate系列首款正版手游，100万字剧情描绘史上最大圣杯战争！】\n" +
                    "《FGO》剧情原案由Fate之父奈须蘑菇亲自执笔，长达100万字的小说级故事线将为您揭露多重背景设定！\n" +
                    "\n" +
                    "【史上最多英灵集结，跨越时代的终极召唤！】\n" +
                    "在《FGO》中可召唤的从者包含了《Fate/Zero》、《Fate/stay night》等多部知名Fate作品中的经典角色，以及多位《FGO》首创英灵与您展开命运的羁绊，更有全新职阶首次于Fate系列中登场！\n" +
                    "\n" +
                    "【指令卡式战斗，原汁原味的日式RPG！】\n" +
                    "在《FGO》中，战斗通过对从者下达的命令用指令卡来表现，通过回合制的形式展开指令战斗。战斗分为战术阶段与指令阶段，根据您的选择，从者会分别发动攻击。己方攻击后，转为敌方行动。敌方行动后一回合结束。\n" +
                    "\n" +
                    "【50多位知名画师参与英灵绘制，40位以上声优倾情献声！】\n" +
                    "《FGO》力邀武内崇在内的50余位知名画师组成超豪华美术团队，更特邀Fate系列原班声优参与配音！",

            "不可思议的简单。难以置信的有趣。\n" +
                    "\n" +
                    "挑选您的卡牌来战个痛快吧！在《炉石传说》这款节奏明快的游戏中，您将扮演一位英雄机智地使用各种策略，在持续若干分钟的对战中，通过打出各种威力强大的卡牌来施放法术、召唤随从来夺取这变幻莫测的战局的控制权。无论您是第一次玩卡牌游戏，还是已经是卡牌游戏老手，《炉石传说》所蕴含的游戏深度和魅力都将让您欲罢不能。\n" +
                    "\n" +
                    "一玩即会: 充满趣味的初始任务会带您立即感受《炉石传说》最为纯粹的游戏魅力。\n" +
                    "\n" +
                    "打造套牌:有上千张可以赢得和制作的卡牌——玩得越久，属于您的卡牌也就越多。\n" +
                    "\n" +
                    "切磋牌艺： 在练习赛中与电脑控制的魔兽英雄们对战。萨尔、乌瑟尔、古尔丹——他们都在这儿！\n" +
                    "\n" +
                    "卡牌收藏在线存储：您的卡牌收藏与您的战网通行证相绑定——这使得您可以随意选择平板设备或PC进行游戏。\n" +
                    "\n" +
                    "一战成名：当您感觉自己具备一定实力时，迈入竞技场与其他玩家一较高下，争取赢得大奖的机会！\n" +
                    "\n" +
                    "需要至少2GB的硬盘空间才能安装《炉石传说》\n" +
                    "\n" +
                    "支持语言：\n" +
                    "* English\n" +
                    "* Français\n" +
                    "* Deutsch\n" +
                    "* Español (Latinoamérica)\n" +
                    "* Español (Europa)\n" +
                    "* Italiano\n" +
                    "* Português\n" +
                    "* Polski\n" +
                    "* Русский\n" +
                    "* 한국어\n" +
                    "* 简体中文\n" +
                    "* 繁體中文\n" +
                    "* 日本語 \n" +
                    "* ไทย (泰文) \n" +
                    "\n" +
                    "©2017 暴雪娱乐股份有限公司版权所有。炉石传说，战网与Blizzard Entertainment是暴雪娱乐股份有限公司在美国和(或)其它国家的商标或注册商标。",

            "《战箭天下》（Battle Of Arrow），是由上海墨游倾力打造，以骑马射箭为题材的轻竞技实时战斗手游，在游戏里与全球玩家展开实时对战，考验你的实力。\n" +
                    "游戏武器共分弓箭和弩两大类6种，玩家通过手指滑动屏幕，点击触碰进行射击。花样的进攻，瞄准射击，轻松完美演绎各项真实战斗，酣畅对决，让你劲爆全球！\n" +
                    "\n" +
                    "【产品特色】：\n" +
                    "1.操作独特：独特的陀螺瞄准功能让你欲罢不能。\n" +
                    "2.马背战斗:狂奔的马 紧绷的弓 体验有如真实骑马战斗的紧张快感；\n" +
                    "3.竞技场模式：在各种古老的圆形竞技场里战斗，一箭定乾坤。\n" +
                    "4.硬派描边漫画：水墨剪影的色彩，硬派漫画风格，美术风格让人眼前一亮。",

            "【声优助阵 顶级声优倾情加盟】\n" +
                    "\n" +
                    "人气声优钉宫理惠、能登麻美子、茅野爱衣、堀江由衣、小清水亜美、野中藍、佐仓绫音、南條愛乃、田村ゆかり、内田真礼等百位CV倾情献声！\n" +
                    "\n" +
                    "【重型建造 霰弹枪正式实装】\n" +
                    "\n" +
                    "重型建造为高级形式人型建造，霰弹枪将在重型建造中出现。霰弹枪作为自带护甲的特殊“tank”职业，带有“范围伤害+击退”要素，另外通过 “装备校准”和“装备强化”对装备的属性进行进一步提升，培养精锐少女击退铁血攻势！\n" +
                    "\n" +
                    "【战术少女 百位枪娘多元养成】\n" +
                    "\n" +
                    "精美立绘涵盖各时期的知名枪械，百款战术少女任意搭配，多元化养成：属性强化培养麾下主力、技能训练领略枪娘作战技巧、小队扩编壮大规模….让玩家麾下的少女成为前线尖兵！\n" +
                    "\n" +
                    "【策略布阵 即时操作多线推进】\n" +
                    "\n" +
                    "前排接敌、后排输出，战斗中自由调整阵型站位、合理分担伤害，战略地图多线部署、自由控制小队推进，从此告别自动推进无限掉沟的惨剧。",

            "1、增加海上载具：皮艇，增加地图中的船只生成点\n" +
                    "2、增加声源提示，通过声音图形提示感知音源大致方向和远近但无法精确判断位置，该功能可开关\n" +
                    "3、增加游戏报错功能按钮，主界面和战斗界面可提交报错反馈\n" +
                    "4、增加拾取物品优先级的显示，修改了物品拾取栏，使玩家拾取物品更便捷\n" +
                    "5、增加副武器：弹弓测试版，未开发完整前只在靶场可以体验操作，下个版本会完善后加入到游戏中\n" +
                    "6、增加玩家组队中被淘汰后断线重连机制，还有队友生存时，被淘汰的玩家可以断线重连该局游戏观战\n" +
                    "7、增加组队中被淘汰后提前退出战场的结算界面，提前退出战场不会获得最终排名的金币奖励，但在该局结束后战绩依然记录到个人数据\n" +
                    "8、增加小地图标记自己位置的功能\n" +
                    "\n" +
                    "优化内容：\n" +
                    "1、调整了移动跳跃高度，现在移动中跳跃高度与疾跑中跳跃高度一致\n" +
                    "2、调整了角色受击区域判定，将头部分为脑部和脸部，击中脑部伤害为200%，击中脸部伤害为150%\n" +
                    "3、优化了疾跑的操作体验，并且削弱UI的视觉提示影响\n" +
                    "4、优化了射击的枪口火焰效果和子弹弹孔效果\n" +
                    "5、优化了驾驶载具移动的镜头\n" +
                    "6、持续进行外挂软件打击和防外挂工作\n" +
                    "\n" +
                    "BUG修复：\n" +
                    "1、修复了VIVO部分机型开镜的显示异常问题\n" +
                    "2、修复了载具上机瞄射击的镜头异常问题\n" +
                    "3、修复了观战队友的部分BUG\n" +
                    "4、修复了装备有弹夹的武器丢弃后子弹数量异常\n" +
                    "5、修复了近战武器卡脸问题\n" +
                    "6、修复了开镜开枪后快速切枪开镜异常\n" +
                    "7、修复了驾驶载具的显示同步问题\n" +
                    "8、修复了枪械替换中我的子弹退还异常问题\n" +
                    "9、修复了断线重连导致的血量状态异常BUG\n" +
                    "10、修复了ipad自定义按钮位置边缘无法移动的问题",

            "大吉大利，今晚吃鸡",

            "小红帽从小就与外婆相依为命，但不幸的是有一天外婆神秘失踪。\n" +
                    "根据警卫队的调查结果显示：他们最后的线索都停留在黑森林。\n" +
                    "为了寻找唯一的亲人，小红帽孤身一人前往黑森林，这一天正是月圆之夜，她即将面对的是守护森林的精灵、凶残的狼人、隐居的女巫以及慢慢浮出水面的真相…",

            "《万象物语》（Sdorica）是由台湾著名手游厂商雷亚游戏历时四年精心打造、龙源网络代理发行的一款唯美幻想风角色扮演手游。清新唯美的日式幻想风格，搭配全程交响乐实录的极致效果，围绕六大种族交织的庞大世界观，向玩家展示了一个瑰丽多彩的奇幻世界。游戏采用了策略+消除的独特战斗玩法，玩家将以一位谛视者的身份，引领超过三十位独具特色的角色，在极致的视听盛宴陪伴下，一步步探索凡泰缇大陆过去、现在与未来的历史。",


            "躺着也能玩绝地求生？PUBG&天美联合出品的正版绝地求生手游《绝地求生 全军出击》帮你实现！\n" +
                    "【全面还原，应有尽有】\n" +
                    "顶级UE4引擎全面还原端游大世界，军事基地、Y城、98k、8倍镜...你熟悉的东西这里应有尽有。\n" +
                    "【手机虽小，乐趣不减】\n" +
                    "人物动作、全系列武器手感经过打磨调优，带给你顺畅的操作体验。就算躺在床上，也能体验100%的游戏乐趣。\n" +
                    "【单排组队，只争第一】\n" +
                    "100人公平竞技，在公平的战斗中大展拳脚，享受竞技的乐趣！\n" +
                    "大吉大利，今晚第一！",

            "1，吃一碗饭更新一条，图个吉利一共8个更新内容。\n" +
                    "2，策划吐着白沫修完了全部错别字，玩家为此集体打call。\n" +
                    "3，开放连面不绝的主线任务。\n" +
                    "4，由于圣诞降临，为城镇和经营各添加1首背景音乐。\n" +
                    "5，新增圣诞厨师，新增雪花鱼糕等新料理，就着吃吧。\n" +
                    "6，漫天白雪的圣诞主题登场！\n" +
                    "7，新增支线任务（新增踢馆任务、外卖任务等类型）\n" +
                    "8，新增30种客人对话，只有你想不到，没有他们不敢聊的。\n",

            "■瞬间变换的攻防，3v3即时对战游戏！\n" +
                    "拥有传统即时对战类游戏的玩法，上手难度低，公平性强，团队配合乃是重中之重。在游戏的同时可与好友加强交流互动，一起体验游戏所带来的快乐。\n" +
                    "\n" +
                    "■三分钟决定命运！快速的夺阵对战！\n" +
                    "游戏单局时间设定为3分钟，玩家可以充分利用碎片时间进行游戏，同时也防止了因单局时间过长而导致疲劳。胜负不仅取决于操作、阵容，技能搭配和团队配合也是重中之重。因此即使没有MOBA游戏经验的玩家也可轻松上手。\n" +
                    "\n" +
                    "■准备好了吗？只属于你的最强阵容！\n" +
                    "每次对战可自由选择1个英雄和4张技能卡，而搭配的阵容往往在决定胜负时起到关键的作用。游戏平衡性设计出众，在游戏中没有最强的阵容，只有属于玩家的个性搭配。",

            "网易和风匠心巨制，开启唯美奇幻之旅\n" +
                    "网易2016年研发的3D RPG半即时回合制卡牌手游「阴阳师」取材于阴阳师晴明的经典故事，延续了和风物语的一贯优美与神秘。\n" +
                    "\n" +
                    "故事围绕着主人公晴明展开，在平安时代的京都，风光旖旎，却暗流涌动——魑魅魍魉伺机而动，阳界秩序岌岌可危。幸而，世间存在着一群被称之为「阴阳师」的异能者——也就是玩家将扮演的「游戏主角」。这群异能者不但懂得观星测位、画符念咒，还可跨越阴阳两界，支配式神。为消除天、地、人、鬼之间的矛盾，阴阳师们调查一切奇异事件，维系着阴阳两界的平衡，同时也探寻着自身的过往⋯⋯\n" +
                    "风光绚丽的京都画卷慢慢展开，精彩跌宕的百鬼绮谭也就此拉开了帷幕⋯⋯",

            "《幸存者》是一个开放的随机世界，横版Roguelike游戏。每次体验世界都会不一样。每个僵尸都有自己的特点，只要你细心观察可以通过躲避和战斗选择不同的策略求生。\n" +
                    "\n" +
                    "相较于典型的Roguelike类型游戏《幸存者》的游戏结构删繁就简，没有复杂的操作系统和繁多的任务剧情，抛去重担，随意自由的畅享末日游戏快感。\n" +
                    "\n" +
                    "最新Unity引擎下横版动作体现更加流畅，自由，佐以明亮的欧美画风，给人一种焕然一新的末日感受，take it easy，相信自己！\n" +
                    "\n" +
                    "末日来临，你到底能活多久？那些跟你一样活着的幸存者，你是选择杀死还是共存？你来决定。"
    };
}
