package com.example.l.wanshaapp.Rankingtools;


import com.example.l.wanshaapp.R;

/**
 * Created by 侯顺发 on 2018/5/24.
 */

public class ThreeFragmentTools {

    //图片资源
    public  static  int img[] = {
            R.drawable.rankingorder_01, R.drawable.rankingorder_02, R.drawable.rankingorder_03, R.drawable.rankingorder_04, R.drawable.rankingorder_05,
            R.drawable.rankingorder_06, R.drawable.rankingorder_07, R.drawable.rankingorder_08, R.drawable.rankingorder_09, R.drawable.rankingorder_10,
            R.drawable.rankingorder_11 , R.drawable.rankingorder_12 , R.drawable.rankingorder_13 ,R.drawable.rankingorder_14 , R.drawable.rankingorder_15 ,
            R.drawable.rankingorder_16, R.drawable.rankingorder_17 , R.drawable.rankingorder_18 , R.drawable.rankingorder_19 , R.drawable.rankingorder_20

    };
    public  static  int img1[]={
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star , R.drawable.star , R.drawable.star, R.drawable.star , R.drawable.star,
            R.drawable.star , R.drawable.star , R.drawable.star , R.drawable.star , R.drawable.star };
    public  static  int img5[]={
            R.drawable.halfstar, R.drawable.star, R.drawable.halfstar, R.drawable.halfstar, R.drawable.star,
            R.drawable.halfstar, R.drawable.halfstar, R.drawable.errostar, R.drawable.errostar, R.drawable.errostar,
            R.drawable.star , R.drawable.halfstar , R.drawable.star,R.drawable.halfstar,R.drawable.errostar,
            R.drawable.halfstar,R.drawable.halfstar,R.drawable.star,R.drawable.star,R.drawable.star};
    //文字资源（游戏名）
    public  static   String title[]={
            "天涯明月刀","堡垒之夜手机版","火影忍者OL","地城制作者","方舟:生存进化",
            "犬夜叉-奈落之战","深渊地平线","明日之后","合金弹头：反击", "归途24小时",
            "约战：精灵再临","陨落世界","战双：帕弥什","原力守护者","天谕",
            "比特小队","神位纷争","超次元大海战","叛逆的鲁鲁修","代号：Z"};
    public  static  String date[]={
            "MMORPG","PVP","角色扮演","经营","生存",
            "MMO","二次元","多人联机","塔防","生存",
            "二次元","生存","","像素","角色扮演",
            "地牢","二次元","拟人","策略","多人联机"};

    public  static  String date2[]={
            "角色扮演","吃鸡","策略","建造","多人联机",
            "","3D","生存","像素","末日",
            "后宫","恐龙","","竖屏","MMORGP",
            "多人","3D","二次元","日系","生存"};

    public  static  String date3[]={
            "","Online","卡牌","Roguelike","恐龙",
            "","美少女","末日","合金弹头","独立游戏",
            "Galgame","多人联机","","MOBA","",
            "Roguelike","PVP","美少女","动漫","丧尸"};

    public  static  String  date5[]={
            "","","","","",
            "","","","","",
            "","","","","",
            "","","竞技","","战棋",""};

    public  static  String  data4[]={
            "9.3","9.5","9.0","9.3","9.7",
            "9.3","9.4","8.0","9.6","8.8",
            "9.7","9.0","9.9","9.4","8.0",
            "9.3","9.5","9.2","9.7","9.5"};

    public  static  String  data6[]={
            "今年最为期待的国产手游","No1.大逃杀游戏登录游戏","火之意志，永不熄灭","成为地宫之主，击溃来犯勇者",
            "与数以百计的玩家一同生存", "重回妖异战国，寻回羁绊","都上命运之战的大海战","保持你的求生意志活下去吧",
            "经典重现，策略对战", "穿越火线，寻找曙光", "富含文字的Galgame游戏","在史前巨兽和丧尸潮流中生存下去",
            "为回归地球献上你的生命","战场全随机，横竖都能玩", "端游改手游，高画质的保障", "无限循环，多种结局",
            "母亲再也不用担心我的肝了，","带上你的美少女去征服大海吧","错的不是我，是这个世界","无序模式下的人类黑暗面"};

    public static String publisher[]={
            "成都天元开发工作室","谭儿子游戏集团","贤儿子游戏集团","刘儿子游戏集团","发爸爸游戏集团",
            "成都天元开发工作室","成都天元开发工作室","成都天元开发工作室","成都天元开发工作室","成都天元开发工作室",
            "成都天元开发工作室","成都天元开发工作室","成都天元开发工作室","成都天元开发工作室","成都天元开发工作室",
            "成都天元开发工作室","成都天元开发工作室","成都天元开发工作室","成都天元开发工作室","成都天元开发工作室"
    };


    public static  String xiangqingvideo[]={
            "http://sj.video.5054399.com/sjyx/app_gonglue/shouyou/xcsp/20171129TYMYDXCP.mp4",
            "http://sj.video.5054399.com/sjyx/baoleizhiyeaz/baoleizhiye.mp4",
            "http://sj.video.5054399.com/sjyx/huoyingrenzheOLaz02/huoyingrenzheOLaz02.mp4",
            "http://hc49.aipai.com/user/880/38107880/1004/card/48186572/card.mp4?l=b",
            "http://sj.video.5054399.com/sjyx/app_gonglue/fzscjh/201803261.mp4",
            "http://sj.video.5054399.com/sjyx/benghuai3az/benghuai3az.mp4",
            "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""

    };
    public static  String shouchang[]={
            "收藏","收藏","收藏","收藏","收藏",
            "收藏","收藏","收藏","收藏","收藏",
            "收藏","收藏","收藏","收藏","收藏",
            "收藏","收藏","收藏","收藏","收藏"
    };

    public static  String download[]={
            "http://wuxia.qq.com/",
            "http://render-ant.9game.cn/p/q/29fb90efce/portal.html?ch=LN_307&ng_ch=KM_69176&lch=VN_752&a=48245_1524643143579",
            "https://www.1gamer.cn/prom/tg/game?appid=12695&et=3&cid=3236&k=e781abe5bdb1e5bf8de880854f4c",
            "http://01.android2-phone.ujint.cn:8090/dilaozhizaozhe_yxdown.com.apk?ch=myx&sid=722750&name=%e5%9c%b0%e5%9f%8e%e5%88%b6%e4%bd%9c%e8%80%85&rec=False&stype=%e8%a7%92%e8%89%b2%e6%89%ae%e6%bc%94&tags=RPG%2c%e5%83%8f%e7%b4%a0%2c2D%2c%e5%a1%94%e9%98%b2%2c%e5%9c%b0%e7%89%a2",
            "http://playark.com/",
            "http://ssa.yundun.com/cc", "http://ssa.yundun.com/cc","http://ssa.yundun.com/cc",
            "http://ssa.yundun.com/cc","http://ssa.yundun.com/cc","http://ssa.yundun.com/cc",
            "http://ssa.yundun.com/cc","http://ssa.yundun.com/cc","http://ssa.yundun.com/cc",
            "http://ssa.yundun.com/cc","http://ssa.yundun.com/cc","http://ssa.yundun.com/cc",
            "http://ssa.yundun.com/cc","http://ssa.yundun.com/cc","http://ssa.yundun.com/cc"
    };

    public  static  String xiangqingtext2[]={
            "《天涯明月刀》手游改编自为腾讯同名端游，是一款3D MMORPG游戏，目前手游仍在研发阶段。",

            "No.1的大逃杀游戏登录手机！在100人的PvP中组队，参与竞争，成为唯一的获胜者！建造、战斗、生存到最后一秒，赢得您的胜利！\n" +
                    "\n" +
                    "在手机上，你能体验到和PlayStation 4，Xbox One，PC和Mac一样的100人PvP游戏，一样的地图，一样的玩法，一样每周更新！建造你自己的堡垒，争取成为最后一名存活者！快来和全球的玩家一起，在同一个世界里并肩战斗。\n" +
                    "\n" +
                    "《Fortnite》需要互联网连接和iOS 11，仅支持iPhone 6S/SE，iPad Mini 4，iPad Pro,，iPad Air 2，iPad 2017及以上版本的设备。\n",

            "株式会社万代南梦宫娱乐和魔方工作室群共同打造，腾讯出品的全新羁绊策略手游《火影忍者OL》正式亮相。超百位忍者将悉数出现，玩家可通过收集不同的忍者，搭配出最具火影特色的combo策略战斗体验。同时，游戏中忍界大战、忍者考试、小队PK等火影式特色玩法都将为玩家提供丰富的社交体验，在战斗中寻找专属自己在火影忍者中的“爱恨情仇”。",

            "通过无数选项布置地宫的Roguelike类地宫建造游戏。\n" +
                    "在地宫布置各种陷阱和设施，并雇佣可通过战斗成长的怪兽，发现神秘力量的神器，击退攻击地宫的勇士！",

            "《方舟：生存进化》故事主要讲述，一群人醒来便出在神秘海滩，为了生存而探索远古开放世界，你需要通过合作/竞技来获取生活必需品。人类需要打猎、收获、研究技术，甚至要根据动态天气变化（酷热白昼、冰冷夜晚）搭建住处，而危险的远古动物会随机出现威胁人类生存。",

            "《犬夜叉-奈落之战》将于5月29日开启战国内测，带你重回妖异战国，寻回记忆中遥远的羁绊，重温超越时空的思念。\n" +
                    "当然，你也可以加入各种社区平台交流穿越心得，第一时间获得最新资讯，也有机会参加活动赢得各种周边哦。",

            "由于部分急于立功的科学家所进行的重离子冲撞实验，导致本世界的晶壁系遭受破坏，从而连通了另一个未知世界。\n" +
                    "\n" +
                    "打破晶壁系造成的冲击，导致实验所在地的陆地被湮灭，大量海水从异世界流出，人类的生活空间亦被极度缩小。",

            "我们生存的世界，实际上只是个密封的盒子。不断拓展的科技前沿，带来更多未知的危险；愈发便捷的交通手段，让罪恶和病毒四处蔓延。当毁灭性的病毒席卷各国，秩序和契约崩坏殆尽，你，又该何去何从？",

            "指尖交战，脑力对决！SNK制作，合金弹头正统新作《合金弹头反击》！\n" +
                    "《合金弹头反击》由SNK制作，是合金弹头系列最新作品。作品囊括合金弹头历代角色，全军种可操控单位多达400余个，可以任意进行搭配，实现多样战术组合。游戏融合了丰富的剧情模式，不仅可以探索各角色背后的故事，还能了解合金弹头系列深奥的世界。",

            "秋，凌晨。突如其来的袭击，一通来电宣判了你的死刑…你还有24小时的时间，你必须做点什么！\n" +
                    "《归途24小时》是一款极具沉浸感的横版末日求生独立单机游戏，危机四伏的荒野战场，前所未有的生存考验。开放式结局剧情与关卡选择完美融合由你解锁，你的每个选择将决定是幸存or死亡！被饥饿的僵尸包围，关乎生死的死亡时速，无比艰难也要活下来！",

            "约会大作战手游《约战：精灵再临》是一款角川正版授权，原版声优倾情献声的横版动作手游，富含Galgame的文字恋爱冒险元素以及各类模拟养成和社交休闲玩法。从现在开始，点击预约，准备开始你约会的使命吧！",

            "21世纪末期，人类遭遇来自半人马座α星的Alpha Centauri入侵，水资源被掠夺的同时，大爆炸带来的辐射和外星科技让地球变得满目疮痍，充满未知的危险：再次出现的史前巨兽，死而复生的丧尸潮流，在陨落的世界里面，人类赖以生存的资源濒临灭绝，社会秩序崩坏殆尽……",

            "新地球历2079年，距离第二次世界大战过去两个甲子。人类开创出有史以来最发达的盛世局面，继智能机器人、克隆技术的蓬勃发展后，信息网络技术被熟练的运用在各个领域。\n" +
                    "\n" +
                    "以黑野氏集团为代表的高新科技产业得到迅猛的发展，产品渗入人类生活的各方各面，衣食住行——甚至于身体内部的芯片植入，用以保护脑海意识领域的一切。\n" +
                    "\n" +
                    "然而也正是这种高智能，让人类再次陷入了恐惧的深渊。",

            "《原力守护者》是一款有Roguelike元素的MOBA手游，在MOBA的刺激对抗中，融入Roguelike的随机性，给你从没有过的超快感体验！游戏同时设置了横屏和竖屏两种操作模式，战场全随机，横竖都能玩！",

            "此间少年，再次相谕。网易旗舰级游戏IP《天谕》同名手游，是一款由盘古工作室自主研发的幻想MMORPG，在手机端呈现高品质游戏体验，打造一个充满无限可能的3D幻想大世界。",

            "探索各个星球，获取强力的道具和装备，战胜不同类型的敌人，拯救危在旦夕的星系。平行宇宙空间，丰富的元素，无尽的循环，多样的结局……",


            "曾为游戏迷们带来《山海战记》的微笑科技最新作品！\n" +
                    "耳目一新的 3D 动作对战游戏，探索科技与神力交汇的终末都市。",

            "在未来超科技时代，人工智能为代表的科技高度发达，然而科技无法阻止环境恶化与资源紧缺。与此同时，贫富两极分化极端严重，秩序混乱，精英区和贫民区并存，“人类权限等级”制度在全球范围内建立。之后人类纷争加剧爆发世界大战，全面的核战争爆发。巨大的能量引发地壳发生大规模变动，海平面迅速上升。地球生态坏境骤变，各国联络艰难，逐渐陷入孤立状态。\n" +
                    "人类在地面上的生存进入倒计时……",

            "《叛逆的鲁路修》官方正版授权3D日式SRPG手游预约，今日正式开启！\n" +
                    "\n" +
                    "目前，游戏还在紧张的开发阶段，项目的最新消息我们会第一时间在TapTap公布，欢迎广大玩家关注《叛逆的鲁路修》，给游戏提出宝贵的意见。\n",

            "代号：Z是天之游自研的一款多人末日生存类手游，在末世之下，现有社会规则都被打乱，人类世界会进入无序状态。游戏中，玩家需要时刻提防僵尸的袭击，直面恶劣的生存环境，在世界末日中探求生存，无论是个人单打独斗还是和其他伙伴共同合作，都是为了寻找稀缺的生存资源，为在这个世界多活一天而努力，同时也要提防其他玩家背后的暗剑。"

    };

    public  static  String xiangqingtext4[]={
            "仙人抚我顶，结发受长生。\n" +
                    "\n" +
                    "天刀，我就是要吹爆。\n" +
                    "\n" +
                    "天刀剑网等mmorpg大佬早就想踏足移动端，可能是没有什么值得认真的对手 就一直鸽了下去\n" +
                    "\n" +
                    "直到隔壁楚什么香在该领域突然出现。狂卷7个亿 天刀最终不得不迈出这一步了 233\n" +
                    "\n" +
                    "mmorpg大体都是一样的 不过天刀算是mmo老牌了 反正至少比香香有资历。特别是宣传的捏脸， 我只想说兼职不要太棒 香香的捏脸一直我都很迷 很喜欢华山 但华山的男的初始 。。exm? 怎么调 都是大叔 捏半个小时才能整出一个差不多看得过去的年轻人 可能是我手残把。 不过看宣传里 天刀的捏脸感觉还是不错的 至少端游就很让人舒服。同样用半个小时绝对不会捏的看不过去 所以手游我相信会更好 。\n" +
                    "\n" +
                    "而且网易的代理和产权意识属实不敢恭维啊 我们来说一下网易在都干了点啥\n" +
                    "\n" +
                    "首先涉足移动端大逃杀型游戏 ，并没有与原厂商交涉 反而学那些小作坊一样自己换个名字 打着吃鸡这个词大肆宣传 后蓝洞一纸诉状 且刺激全军等官方游戏进入 荒野精心炒起来的ip转手献给tx爸爸 然后荒野现在已经凉了 不接受反驳。（滑稽）\n" +
                    "\n" +
                    "然后觉得mmo牛批 好， 那我就在山寨（划掉）创作一款只是有！点！类！似！的错觉手游天刀\n" +
                    "\n" +
                    "。然后果然炒火了mmo 接下来 天刀介入 开心的收下香香炒火的ip 盆满钵满。\n" +
                    "\n" +
                    "为什么我要diss网易呢？ 为什么我要吹爆天刀呢？ 不都一样的吗？ 是一样的 但是厂商描述的欺骗\n" +
                    "\n" +
                    "楚留香搞个高自由度 然而我认为除了能满地图飞飞 有些小选项外 剩下的没啥自由度 。\n" +
                    "\n" +
                    "天刀很识相 知道没有很高的自由度所以从来不拿自由度说事 而是说特效 画面 捏脸等特色 这就很开心了 试想一个冲着高自由度的人玩一个根本不是自己所要的游戏能玩下去吗 一个本身就为了捏脸 画面 而去 而游戏本事确实做到了 当然可以玩的下去。",

            "VOICE CHAT IS HERE! - Voice chat with your party can now be enabled in settings. Push-to-Talk with your party members!\n" +
                    "\n" +
                    "CUSTOMIZABLE CONTROLS - We’ve improved customizable controls based on your feedback. Come check it out and let us know what you think.\n" +
                    "\n" +
                    "Additional stability improvements and bug fixes.",

            "未曾落幕的故事，未曾目睹的忍术，未曾忘却的热血与感动，未曾放下的牵挂与友情，将在2018年再度开始！\n" +
                    "正版授权，更精美的画面，更多样的玩法，更庞大的原版声优阵容，《火影忍者OL》手游将为各位忍者学员带来不一样的体验。火之意志，永不熄灭！\n" +
                    "\n" +
                    "经典剧情，亲身参与\n" +
                    "与鸣人一起，亲历重大战役与感人瞬间，自由选择职业，做众强者中独一无二的自己！招募忍者小队，在火影忍者的宏大世界中自由探索，上百知名忍者，冒险旅程中永不寂寞！ 「有话直说，这就是我的忍道！」在《火影忍者OL》手游中，追求属于自己的忍道吧！\n" +
                    "\n" +
                    "华丽忍术，目不暇接\n" +
                    "顶级美术制作，用热爱呈现最华丽忍术，原版监修加持，用专业确保最严谨还原。螺旋丸、千鸟、沙瀑大葬、月读……精彩绝伦数量繁多的忍术，不辜负玩家的期待，也绝不辜负每一位忍者的才能！\n" +
                    "\n" +
                    "连击Combo，羁绊再临\n" +
                    "独创Combo系统，激烈爽快的连击表现，再现忍者之间的精妙配合与深深羁绊！鸣人与佐助，再不斩与白，传说中的三忍，将再次联手攻击，对抗劲敌！开放规则，自由搭配，打造属于你的最强羁绊组合吧！\n" +
                    "\n" +
                    "原版声优，声临其境\n" +
                    "动画原版CV阵容，只为最原汁原味的火影忍者。跟随他们的声音，再临那些至燃时刻和飙泪瞬间！\n" +
                    "\n" +
                    "公平竞技，策略第一\n" +
                    "追求公平游戏乐趣，拒绝无脑数值碾压！从轻松娱乐对战，到高端烧脑竞技，多样的无数值PVP玩法将策略乐趣摆在首位！和众多忍者学员一较高下吧！\n" +
                    "\n" +
                    "结交同伴，并肩作战\n" +
                    "组织、师徒、组队副本，丰富玩法助你结交志同道合的好友，体验并肩作战的快感。和同伴一起，在《火影忍者OL》打造最强组合，百忍同屏，畅快对决！",

            "◆ 内容\n" +
                    "- 以特殊能力指挥地宫的7名魔王！\n" +
                    "- 100多种勇士及怪物\n" +
                    "- 地宫内可布置的70多种陷阱及设施\n" +
                    "- 130多种神秘的神器\n" +
                    "- 各种活动\n" +
                    "- 各种解锁要素\n" +
                    "\n" +
                    "目前还在不断开发新的内容。\n" +
                    "我们将持续增加更多魔王和陷阱及怪兽，并准备各种游戏模式。\n" +
                    "\n" +
                    "◆ 创造属于自己的地宫\n" +
                    "请慎重布置陷阱、设施及怪兽。利用击退勇士获得的奖励，可建造更强力的地宫。考虑各个设施及怪兽的特性找出最佳组合，并建造具有最佳效率的地宫。\n" +
                    "\n" +
                    "◆ 探险命运\n" +
                    "每天获得新的命运卡牌。想要战斗就迎接勇士，需要娱乐就进行活动。如果要与强敌对战，就可将强力的勇士召唤至地宫。\n" +
                    "每一场游戏可选择不同命运，给您带来各种新的体验。\n" +
                    "\n" +
                    "※ 注意：离线游戏\n" +
                    "本款游戏未另设服务器。所有数据将保存至用户的设备，故删除游戏将无法恢复数据。请使用游戏内云端保存功能。\n" +
                    "\n" +
                    "游戏购买后2个小时以内可利用Google提供的退款按键进行退款。\n" +
                    "请注意，经过2个小时以后将无法进行退款。\n" +
                    "应用内购买的话，因该游戏是无法回收道具及停止生效的离线游戏，只能通过Google进行退款。\n" +
                    "若发生误购及其他问题，请至以下地址进行退款。\n" +
                    "https://support.google.com/googleplay/contact/play_request_refund_apps?rd=1",

            "《方舟：生存进化》手机版的界面不同于电脑版，官方特意针对手机屏幕相对电脑来说较小等特点优化了屏幕菜单，使我们的操作更加的快捷流畅。\n" +
                    "\n" +
                    "下载方/舟大家加一下Q群( 786816190）\n" +
                    "\n" +
                    "背包\n" +
                    "\n" +
                    "相信各位小伙伴们从视频中已经发现了，整个游戏屏幕中除了工具栏和血量栏外，只有一个图标持续出现，那就是背包栏，这也无形中告诉了我们这个按键非常的重要，有很多事情都需要用到它。\n" +
                    "\n" +
                    "再点击背包按键后，有三个部分组成了我们的整个屏幕：\n" +
                    "\n" +
                    "左下角为工具栏，在这里面我们可以查看或者携带更多的工具；\n" +
                    "\n" +
                    "左上方为可以完成的任务，我们可以根据这一栏的提示去完成一些工作；\n" +
                    "\n" +
                    "而在屏幕右侧占据很大一部分的则是你的存货仓库，在这里你可以查看当前拥有的物品，小伙伴们可要多多关注这一栏哦，这一栏的呼出方式不但方便快捷，而且它能清楚地告诉你当前你拥有哪些物品，还有哪些物品需要补充哦。\n" +
                    "\n" +
                    "工具栏\n" +
                    "\n" +
                    "工具栏会持续的在你屏幕的右下角出现，一共有十个工具格子，这使得玩家不论使用哪种工具都非常的方便哦。\n" +
                    "\n" +
                    "血量栏\n" +
                    "\n" +
                    "《方舟：生存进化》手机版会实时的显示出你前方物体的名称和血量，如果你前方是动物的话，则会提示你动物的名字，血量，是否具有攻击性以及当前的等级是否可驯服。\n" +
                    "\n" +
                    "这个小功能能帮助我们熟悉游戏中的物品和生物，而且要是动物的话还能告诉你需不需要逃跑，如果你发现前方是一只高等级高血量并具有攻击性的恐龙的话，那还是说一声打扰了然后溜之大吉吧~\n" +
                    "\n" +
                    "生命体征\n" +
                    "\n" +
                    "在画面中间靠下方的的位置，会显示你的能量，血量等数值，我们在游戏中可要时时刻刻注意这一栏，如果这一栏得数值过低，那还是先脱离战斗，找个安全的地方补充补充能量吧！\n" +
                    "\n" +
                    "本次的《方舟：生存进化》手机版界面操作就为大家介绍到这里了",

            "《犬夜叉》最新正版授权作品2018年登陆移动平台，MMO动作RPG手游《犬夜叉-奈落之战》于2018年5月29日开启战国内测，还原高桥留美子经典名著，再现超越时空的思念。\n" +
                    "\n" +
                    "　游戏特色\n" +
                    "\n" +
                    "　　【人气角色 全数收录】\n" +
                    "　　人气角色+敌对妖魔，完全收录海量角色，个性化育成，让你的最爱成为你的最强。\n" +
                    "\n" +
                    "　　【和风场景 妖异战国】\n" +
                    "　　卡通渲染精美画面，还原人气角色熟悉的面容，再现原作中的妖异和风战国。\n" +
                    "\n" +
                    "　　【激爽连段 硬派战斗】\n" +
                    "　　畅快淋漓的挥舞铁碎牙，施展华丽的法术对决魑魅魍魉，实时操控秀出你的操作。\n" +
                    "\n" +
                    "　　【缔结羁绊 携手而战】\n" +
                    "　　独创系统让你与游戏中相遇的人缔结羁绊，战斗冒险从此不再孤单。\n",

            "【关于游戏】 \n" +
                    "全3D即时射击游戏，包含养成・收集要素。带领喜欢的角色享受自由的海上战斗吧！\n" +
                    "\n" +
                    "【战斗】 \n" +
                    "・虚拟轮盘自由操纵角色。\n" +
                    "・空袭、主炮、鱼雷、副炮等激烈的海战一触即发。 \n" +
                    "・全角色的特有技能。 \n" +
                    "・自动模式搭载。\n" +
                    "\n" +
                    "【模式】 \n" +
                    "・舰队遭遇战、极速模式挑战、鬼姬BOSS挑战、巨型BOSS追击战、巨型BOSS歼灭战、演习模式、休假养成模式等\n" +
                    "・即时PVP。\n" +
                    "・与朋友组队一起进行挑战。\n" +
                    "\n" +
                    "【角色】 \n" +
                    "・搭载AR，让舰姫们现身在现实世界！ \n" +
                    "・休假养成模式，特别搭载360℃自由摄影模式！ \n" +
                    "・3D模型，皮肤换装！ \n" +
                    "・雨宮天、上坂堇、小仓唯、小泽亚李、佐仓绫音、千本木彩花等30多位声优！\n",

            "大家好，我叫Alfred，是《明日之后》项目经理，大家也可以喊我“阿弗”。\n" +
                    "过去一周，我翻阅玩家的每一条留言，其中最多的就是关于测试资格取得方式的质疑和指责，同为游戏爱好者，我非常清楚的了解到，在经历了期盼、下载，等待，卡秒狂点到最后被告知无法进入游戏时的心情。\n" +
                    "那种失落转为失望、愤慨的感受，相信打一百次一星评价也无法填补。\n" +
                    "所以，我完全认同，并坚决支持你们在Tap Tap平台打出一星的评价，这是测试不当应得的后果，也是我们应当承受的教训。\n" +
                    "经过深刻反思，我们决定整改如下：\n" +
                    "1、\t以一级运营事故标准，惩处本次封闭测试负责人以及相关群管理人员。\n" +
                    "2、\t建立蓝贴沟通机制，持续公布产品改动、后续测试机制，并充分听取大家意见。\n" +
                    "3、\t全面筛查官方主播团队，提高准入和专业标准。\n" +
                    "\n" +
                    "接下来，我们将埋头打磨和提升产品。我们要用过硬的游戏品质，把失掉的分数挣回来。\n" +
                    "我们计划对产品做出以下调整，让这个末日世界更加真实：\n" +
                    "1、末日危急，求生者的每一步动作都攸关性命。当他们在慌乱中奔跑，会对方向有更精准的把控；当他们抄起武器自卫，会对打击轨迹有更准确的预判；小地图上增加的地形，将帮助他们幸免于迷路落入丧尸之口。\n" +
                    "2、幸存的人类将发现多种方法，用以更快速地掌握更多生存技能。末世虽然颓败荒凉，但人类从未放弃追求和希望。\n" +
                    "3、这个世界不是乌托邦，幸存者们将会在野外和营地遭遇更大的生存威胁——他们需要充分激发自身潜力、或者与更多幸存者联手，才能增大存活的概率；\n" +
                    "4、资源有限，为了活下去，幸存人类之间的摩擦和争夺时有发生。不少营地因此矛盾加剧，演变成大规模武装冲突。秩序已经崩坏，没有和平条约。\n" +
                    "\n" +
                    "今后，我将不定期为大家带来产品蓝贴，分享产品新加入的有趣机制和最新进展，与大家共同探讨玩法设定。\n" +
                    "在游戏正式上线之前，《明日之后》还将开展一次删档测试。届时，我将对测试形式、测试渠道等相关信息，与大家第一时间进行分享。\n" +
                    "\n" +
                    "这世上所有的误会都来自不理解，所有的矛盾来自不沟通，所有的错过都来自不信任。希望我们能用实际行动，消除误会、解决矛盾、重建信任。\n" +
                    "诚挚期待你们的意见和建议。",

            "---系列正统新作---\n" +
                    "合金弹头20周年之际，SNK开发的系列最新作品，再次拿起武器，重温一币通关的感动。\n" +
                    "\n" +
                    "---丰富策略对战---\n" +
                    "玩家可以将历代全军种角色自由组合成自己的编队，进行多种多样的策略对战玩法，属性压制？不存在的。\n" +
                    "\n" +
                    "---全球玩家匹配---\n" +
                    "来自世界各地的玩家都能在游戏中实时匹配，还有创新的赛季制天梯玩法等你体验，实力上分，拒绝炸鱼。\n" +
                    "\n" +
                    "---历代单位集结---\n" +
                    "收录历代作战单位，P.F.正规军、莫丁军、外星人等共计400余个可操控角色，经典BOSS也可以收入麾下。\n" +
                    "\n" +
                    "---原生2D点绘---\n" +
                    "采用经典的2D像素点绘画风，SNK御用画师作画，场景角色完美还原，枪械战车悉数登场。\n" +
                    "\n" +
                    "---经典音效还原---\n" +
                    "MISSION START，经典声音传承，超强街机代入感，全角色配音和系列BGM完整收录。\n" +
                    "\n" +
                    "---剧情设定揭秘---\n" +
                    "游戏囊括历代世界观，莫丁将军的叛变真相、反叛军与外星人的神秘交易，快来探索这些不为人知的秘密吧。\n" +
                    "\n" +
                    "---隐藏角色设定---\n" +
                    "系列作品中各角色设定展现，被解救俘虏的真实身份、合金战车的升级历程，都将在本作中得到详细解答。\n" +
                    "\n" +
                    "---拳皇角色加盟---\n" +
                    "拳皇系列人气队伍怒队加盟，拉尔夫、克拉克、莉安娜都会出现在游戏中，想看莉安娜穿泳装？下载游戏吧。\n",

            "太感谢各位能进来看看了！耽误玩家的时间是有罪的！所以，Bowen作为游戏的制作人，必须一开始就向大家讲明白：《幸存之日：24小时》已更名为《归途24小时》，它是一款单机，一款既有剧情深度又有射击快感的RougeLike类游戏。它超好玩！\n" +
                    "好吧，如果到此还未打动你，想必也未耽误你多少时间。有缘再见！\n" +
                    "如果你还有意留下，请受Bowen一拜……你的这份支持，必将是我们在此汹涌险恶市场下“幸存”的一份重大助力！谢谢！\n" +
                    "那么，这是个什么样的游戏呢？想象下：天蒙蒙亮，身染致命病毒，你孤身一人在山上，只有24小时……是挣扎求生，还是坐以待毙？\n" +
                    "游戏来源于生活，却不同于生活。我们游戏中，断断没有坐以待毙这个选项。游戏中的你，会燃起最大的求生欲。每一个小时，都是一道关，24小时的终点，结局到底如何？\n" +
                    "游戏过程中，需要操作，需要运气，更需要你的策略和你一步步的积累。这些要素凝集起来，共同构成了一个超好玩的《归途24小时》。\n" +
                    "为什么Bowen这么有信心？因为我们开发团队自己都很爱玩啊！所有的开发成员，游戏时长都在100小时以上！更有团队成员家属不顾劝阻，不眠不休奋战数天，打通了全部12个结局！相信和我们一样选择了TapTap的你，也会超爱这款游戏！绝对的！\n" +
                    "其实，《归途24小时》也是团队现状在游戏中的映射。目前国内的游戏市场上，像我们“发条游戏”这样的小团队，何尝不是在挣扎求生？一线公司的垄断，流量价格高企，版号、审批的困难，都让我们在这市场上“幸存”的难度越来越大。但Bowen始终相信，有着内心对好玩游戏的爱，就一定能争取到玩家的支持，就一定能活下去，活的更好！24小时？不，远远不止，***！\n" +
                    "最后，如果你真能下载并试玩我们的游戏，你一定会发现，你比你想象的更爱这款游戏。它很新颖，它很耐玩。如果你真的觉得好，请一定帮忙安利。谢谢！\n" +
                    "关于Bowen：我是《归途24小时》的制作人，也是发条游戏的创始人。投身游戏圈已十五载，游戏经历超过三十年。既混迹过微软、腾讯这样的大公司；也曾数次创业，奋斗无数黑夜白天。有过《狂斩三国》这样的小招牌游戏，也有几十款游戏，世间再也无从得见。但这颗心始终未冷，勤勤恳恳兢兢业业，总想把最好的游戏呈现。《归途24小时》品质绝对不错，但也绝不是最好的终点！国内单机手游的路并不好走，但总得有人投身其中！或许我们会跌倒在路上，或许我们会被现实打败，但这并不会成为我们停滞的理由，套用一句话来讲，就是我希望做到：爱你所爱，行你所行，听从你心，无问西东！",

            "——约会大作战正版手游 海量剧情结局等你发掘\n" +
                    "游戏对于原作世界观高度还原，不仅能够在游戏中体验横版战斗的快感，还能够通过独特的约会玩法体验与精灵约会的乐趣。多达200余种的剧情结局，每一个选择都可能带来惊喜！\n" +
                    "\n" +
                    "——超自由培养模式 同一精灵多种发展方向\n" +
                    "独创天使与卡巴拉生命树质点系统，高自由度的养成体系，每一个精灵都有多种路线养成，不同路线将造就定位完全不同的精灵，如何培养出拥有自己特色的精灵全看你了！\n" +
                    "\n" +
                    "——原作外传剧情 多种方式达成挑战！\n" +
                    "大量外传副本讲述原著中并未彻底展开的故事剧情，丰富的挑战目标不仅考验着战斗操作，更考验在约会时作出的每一个选择。如何与心爱的精灵进一步加深关系，对身心都是一个巨大的考验！\n" +
                    "\n" +
                    "——Tsunako老师参与制作 原班声优倾情献声！ \n" +
                    "游戏内CG由约会大作战小说官方插画师Tsunako老师参与制作，更特邀约战动画原班CV井上麻里奈、富坚美铃、野水伊织、真田麻美、竹达彩奈、雨宫天、茅原实里、内田真礼伊藤静参与配音！还原最纯正的约战世界！",

            "错综庞大的末日世界体验\n" +
                    "陨落的世界，地球满目疮痍：外星科技入侵地球，生存资源濒临灭绝；人类病变，死亡的人类化为丧尸继续传播死亡病毒；幸存生物狂化，远古生物复活，史前巨兽恐龙重返地球。幸存的人类生存空间正被极度压缩。玩家作为游戏中的幸存者，在这个陨落的世界里只有一个目标，活下来，并且争取活得更久一点！\n" +
                    "\n" +
                    "丰富多彩的恐龙养成玩法\n" +
                    "远古生物复活，史前巨兽恐龙重返地球：剑龙、甲龙、长颈龙、霸王龙等等你知道或不知道的恐龙悉数登场，与外星科技、丧尸等相互交织成错综庞大的末日危机。但是，恐龙带给你的并非全部都是危险，也可能成为你在陨落世界里生存的得力助手。因为，你拥有捕捉并驯养恐龙的机会，所以，你可以让恐龙为你战斗，收集资源，并将它们训练成为你的骑宠，陪伴你冒险，甚至，为你守护你的避难所。\n" +
                    "\n" +
                    "独具特色的幸存者系统\n" +
                    "在陨落的世界中求生，探索更多的资源，将避难所打造成强大生存要塞，自然离不开更多幸存者的加入。避难所拥有幸存者招募功能，玩家升级避难所人口即可源源不断地招募幸存者，每一个幸存者都拥有各自不同的技能和对避难所的增益效果。所以，无论是在生存过程中的资源搜索，还是在玩家间避难所的攻防战中，幸存者都将发挥巨大作用，为你在陨落世界的生存规则中奋勇向前，寻找活下来的最后希望。\n" +
                    "\n" +
                    "策略烧脑的避难所攻防经营 \n" +
                    "避难所带来最后的生存希望，但请不要幻想躲在避难所苟全性命，因为这个残酷的世界不会让你片刻安宁。所以，请激荡你的脑力，提升你的科技，探索、采集、并通过战斗获取更多的资源，然后开启设施去生产更多资源来发展你的避难所，将你的避难所打造成陨落世界里的超级要塞。如果可以，去捕捉和驯养恐龙吧，并且尽可能多的招募幸存者，不同类型的恐龙拥有不同的战斗能力，合理地制定恐龙策略和巧妙的搭配幸存者，将使你在避难所攻防战中所向披靡。\n" +
                    "\n" +
                    "全球同服下的团队生存对抗\n" +
                    "在陨落世界中求生，你肯定会遇到更多如你一般的幸存者。这其中，可能会有和你有着相同原则和底线的同路中人，也有可能有着不相与谋的对手。那么，请与同道者为伍，对陌路人战斗。因为，末日的世界，一切资源都是匮乏的，生存永远残酷。所以，为了活下去，请带上你志同道合的好友、招募幸存者和驯养的恐龙一起，向那些陌路者的避难所尽情的攻击和掠夺吧！",

            "由不为人知的垃圾场里诞生的新型蠕虫病毒帕弥什，沿着电子数据的路线，如同复仇的厉鬼一般席卷了整个地球。所有被侵蚀的电子芯片，都把宿主异化成只知杀戮的可怕机器，人们称之为——感染体。\n" +
                    "\n" +
                    "幸存的人类不得不抛弃变异的地球，逃亡天空。他们在天空铸造起了自己最后的伊甸园，空中花园，并且制作出了能够抵御帕弥什的装置——逆元装置。\n" +
                    "\n" +
                    "然而，人类的身体无法承受装置的压力，幸存的人类只好再次运用自己的智慧，创造出了人类收复地球最后的希望——执行者：构造体。\n" +
                    "\n" +
                    "被‘帕弥什’病毒肆虐的地球\n" +
                    "\n" +
                    "等待“拯救”\n" +
                    "\n" +
                    "请加入我们的队伍，为回归地球贡献出自己的力量。",

            "*打造武器，英雄技能自定义\n" +
                    "你可以为每个英雄打造多把武器，切换武器可以改变英雄技能。每个英雄有不同的技能组合可以研究，持续丰富你的战术。\n" +
                    "\n" +
                    "*轻松上手，随机技能照脸丢\n" +
                    "英雄每次出战都携带5张技能卡，场上随机同时出现3个，用掉一个将切换一张。每个英雄还会有一个必杀技，熟悉技能后，你可以钻研出连招，轻松上手成为全场扛把子！\n" +
                    "\n" +
                    "*BUFF叠加，打造无敌小光环\n" +
                    "战场中会随机出现各种限时buff，捡到就是赚到！战场两侧每隔一段时间还会刷出永久的buff球，可以在你四周无限叠加；当你的buff球数量超过5颗，就问还有谁敢近你身？\n" +
                    "\n" +
                    "*招募野怪，组建推塔小分队\n" +
                    "战场中没有小兵，你需要四处击杀野怪让它们当你的小弟；等到战场中间的中立祭坛一开，就可以带上小弟和队友去打团，分分钟占领中立祭坛，拿下敌方水晶！\n" +
                    "\n" +
                    "*地牢乱斗，1V11单人吃鸡\n" +
                    "更简单更有趣的赛博朋克吃鸡来啦！玩家将以上帝视角操纵角色，需要在地图中不断游走、拾取道具、设置陷阱，争夺野怪，并努力活到最后。",

            "你好，冒险家。\n" +
                    "\n" +
                    "我是小谕，一个云垂大陆人见人爱的美少女。\n" +
                    "\n" +
                    "为了这惊鸿初见，小谕和开发组们精心准备了很久。\n" +
                    "\n" +
                    "当你们看到海天相连的汐语湾和少年时的玄极老公，会不会想起在云垂大陆上无拘无束飞来飞去的时光呢？\n" +
                    "\n" +
                    "小谕知道自己还有很多不足需要改进，请大家相信我，我一定会好好学习，天天向上哒~\n" +
                    "\n" +
                    "同时小谕真诚的邀请可爱的小哥哥小姐姐们在论坛置顶帖中告诉我们，你期待的天谕手游是什么样。我希望我可以成为你心中的那个最独一无二的TA。\n" +
                    "\n" +
                    "请大家给我们多一点点时间，多一点点理解。爱护我，pick我，因为俺是云垂の希望-小谕！\n" +
                    "\n" +
                    "后面还有更多的爆料，大家可以通过关注我们官方平台第一时间获取资讯哦~",

            "《比特小队》历程\n" +
                    "2015年11月，《比特小队》开始原型设计，制作了第一个Demo，确立游戏Rougelike+TPS的核心玩法；\n" +
                    "2016年2月，《比特小队》宏观设计文档、程序架构设计确定，以平行宇宙的世界观作为载体设计游戏；\n" +
                    "2016年3月，《比特小队》正式立项，以“好玩、耐玩”为开发准则开始研发；\n" +
                    "2016年6月，第一个玩家测试版本Alpha1完成，进行了小范围核心玩家测试；\n" +
                    "2016年7月，美术风格大改版，重制已经完成的昆雅星各种场景、机关障碍、怪物等资源；\n" +
                    "2016年8月，Alpha2版本完成，进行第一次万人级玩家测试；\n" +
                    "2016年11月，Alpha3版本完成，包含昆雅、艾斯特、飞船三个主题关卡；\n" +
                    "2017年3月，Alpha4版本开始测试，新增了数十种新武器、道具和新的怪物；\n" +
                    "2017年6月，Alpha5版本开始测试，23天的测试经历了大大小小的紧急修复和服务器维护，是比特历时最长的一次玩家内测；\n" +
                    "2017年11月，Alpha6版本玩家测试，已拥有140+武器道具、120+成就、80+怪物、11名角色，内容接近首个上线版本；\n" +
                    "2018年1月，经过各种细节打磨、内容调优后，进行了第7次玩家测试，收获大量玩家反馈。\n" +
                    "2018年2月，春节期间比特小队进行了首次精英玩家测试，对游戏做了全方位的优化体验。\n" +
                    "2018年3月，由于精英玩家游戏消耗速度过快，游戏新增了16把武器，8个道具，9项新成就。\n" +
                    "2018年4月26日，比特小队iOS中国版正式上线。",


            "◆创新的团队PVP动作竞技类手游，180秒内体验快节奏的热血胜负。\n" +
                    "结合了传统3D动作游戏与格斗游戏的独特系统，通过双人组队竞技的模式，再现更爽快的游戏体验。\n" +
                    "闪避，冲刺，近战，射击——多种操作更考验熟练度与技巧。\n" +
                    "段位排位机制，赢得独属于你的神位荣誉。\n" +
                    "\n" +
                    "◆不同定位的角色自由组合，充分体现组队乐趣！\n" +
                    "远程，近战，生存，打击，输出，每个角色都有各自的长处与短处，分析敌我双方的优势劣势，用战术赢得战斗的胜利！\n" +
                    "搭配英雄独特的术式、灵印、天赋，让你的战术和操作更有效！\n" +
                    "\n" +
                    "◆后启示录式的科技都市，神明与人类博弈的舞台\n" +
                    "于末日之后生存下来的人们，获得神之碎片的力量，与神之候补生定下契约，竞争新的神位。\n" +
                    "新生还是衰亡？新世界将在你的手中展现出真实的形态。\n" +
                    "\n" +
                    "◆鲜明的角色、特殊的武装、三大势力的针锋相对\n" +
                    "角色与武装相结合，既是战斗属性，又是角色个性。\n" +
                    "三大阵营体现了不同的理念，命运将降临于做出抉择的每一个人。\n" +
                    "\n" +
                    "◆更多有趣的游戏内容，正式上线后等你来发现\n" +
                    "有趣可爱、不影响数值平衡的装扮！\n" +
                    "无体力限制，不需要肝报废的角色养成！\n" +
                    "丰富的角色互动，非线性多角度的剧情冒险！\n" +
                    "探索世界的真相，珍藏角色资料的图书馆！",

            "羁绊--形态各异舰船角色，动态呈现多重展示！\n" +
                    "区别传统舰娘题材，游戏中角色与船舰是两个不同个体哦！因为契约产生了羁绊，使得船与角色之间的互动更多元化，养老婆送一条船，还不来嘛~\n" +
                    "\n" +
                    "出阵--双重战斗模式即时海战，感受充满张力的临场感！\n" +
                    "指挥官，考验你的时候到啦！战斗可以调整视角哦，无论是第一人称角度的海战真实体验，又或是第三人称的宏观战斗，都需要想好策略呢，加油指挥官，要带领我们取的胜利哦！\n" +
                    "\n" +
                    "育成--养成与收集 部件自由装配，打造专属战舰！\n" +
                    "指挥官SAMA，这可能需要你亲自动手哦！超多舰船部件可供挑选，任你自由搭配，打造出专属于你的专属战舰！在战况变幻莫测的行动区域内，进行大规模作战，用自己的最强舰队去迎击更为强大的敌方舰队！当然摆个阵型排排坐，饱饱眼福也是没问题的(￢?￢)σ\n" +
                    "\n" +
                    "应援--强大的中日画师阵容，塑造各色魅力少女！\n" +
                    "在这个万物皆萌的世界里，御姐、萝莉、邻家少女等性格各个性十足的小姐姐应有尽有！诶嘿嘿(ˉ﹃ˉ)/。她们都在这里静待指挥官您的命令！ (*/ω＼*)\n" +
                    "\n" +
                    "超豪华声优画师阵容（排名不分先后，陆续添加中）！\n" +
                    "声优：伊藤静、户松遥、上坂堇、生天目仁美，佐藤有世，沼仓爱美，渕上舞，小松未可子，小市真琴，小林桂子，喜多村英梨，西田望见，尾崎真実，桐村まり，田泽利依子，上坂すみれ，萩原あみ，前川凉子，千叶泉，七濑亚深，平出まどか，潘めぐみ，奈波果林，加藤美佐，戸板優衣，宫本茉奈，成瀬未亜..\n" +
                    "画师：绚烂的蘑菇、saru、Bison仓鼠、幻象黑兔，小吃，苹果，Gin，星竹，烛凉，king酱，LLEe，W18，小白，とり，废人，小骨，废人，evan扬，Lvans，牧童的短笛，shishio，苍月白龙，蛆虫音，和茶，八九，MadYY，Lvans，Saru，白猫，八才，KN...",

            "以未来地球为虚拟背景 20XX年，在生死边缘获得“Geass”的力量，立志要粉碎神圣不列颠帝国的黑色皇子鲁鲁修，以及获得第七代人型机甲兰斯洛特，立志从帝国内部进行改革的白色骑士枢木朱雀，影响了整个世界。各个势力，各具特色的机甲，各种算计推演，以世界这个舞台上演着惊心动魄的故事！ 让我们一起跟随拥有geass力量的鲁路修，一起体验王子复仇的那份愤怒；一起战斗的伙伴的友情；以及那份改变世界的决心！",

            "昨天代号Z的预约情况发生了异动，在没有任何作为的情况下，突然冲到了预约榜前几名。这是完全在我们的意料之外的，让我们既开心，又紧张。\n" +
                    "\n" +
                    "其实从昨天起，大家就已经开始讨论应该怎么办了。对于任何小公司来说，目前的情况确实是一笔不错的资源，拿来运营一下还是非常美滋滋的。但是同样作为玩家，换位思考了一下，我们做了一个艰难的决定：我们要自爆一波了！\n" +
                    "\n" +
                    "生存实际上是一个大品类。生存建造类在众多大作的支撑下，或许是生存类的主流。\n" +
                    "但是！我们并不是生存建造类的游戏。各位玩家老爷，可能让你们失望了！对不起！\n" +
                    "我们的生存更偏向逃生、求生这个方向。只要是热爱丧尸末日题材的盆友们，肯定YY过这样一个问题：如果丧尸危机突然爆发，我能否存活？可以说，我们的核心玩法就是在此之上建立的。如果你在一个爆发丧尸危机的大型城市里，军方在24小时之后将会毁灭城市，但逃离的方式和人数是有限的，你会怎么做？你能否存活？\n" +
                    "\n" +
                    "嘿嘿！是不是想想还有点小刺激？研发的时候大家玩的还是蛮开心的~\n" +
                    "\n" +
                    "哎，看到这里，或许有一部分玩家老爷已经跑了（别拦我，让我哭一个星期）。不过，如果各位真的喜欢玩丧尸题材的建造类游戏，还是可以关注一下我们的哦~在未来的规划里，我们会继续专注于丧尸这个品类，希望能作出丧尸粉们期待的末日。或许下一个就是建造也说不定哦~\n" +
                    "\n" +
                    "为了打消大家对我们没有干货的疑虑，我们计划下周某个时间放个视频给各位玩家老爷欣赏一下(咳咳，其实现在有视频的，但是貌似制作的时候为了自己玩的开心，做的和（xue）谐（xing）了一丢丢，不过真爽啊嘿嘿)。\n" +
                    "\n" +
                    "好了，多话不说了，我要回去干活了。那么大的城市还得优化，为了自己爽做的和谐内容还是得修改一下啊，嘿嘿。"
    };

};


