package com.example.l.wanshaapp.Rankingtools;


import com.example.l.wanshaapp.R;

/**
 * Created by 侯顺发 on 2018/5/24.
 */

public class Tools {


    //图片资源
    public  static  int img[] = {
            R.drawable.rankinghot_01, R.drawable.rankinghot_02, R.drawable.rankinghot_03, R.drawable.rankinghot_04, R.drawable.rankinghot_05,
            R.drawable.rankinghot_06, R.drawable.rankinghot_07, R.drawable.rankinghot_08, R.drawable.rankinghot_09, R.drawable.rankinghot_10,
            R.drawable.rankinghot_11 , R.drawable.rankinghot_12 , R.drawable.rankinghot_13, R.drawable.rankinghot_14 , R.drawable.rankinghot_15,
            R.drawable.rankinghot_16 , R.drawable.rankinghot_17, R.drawable.rankinghot_18 , R.drawable.rankinghot_19, R.drawable.rankinghot_20 };
    public  static  int img1[]={
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star , R.drawable.star , R.drawable.star, R.drawable.star , R.drawable.star,
            R.drawable.star , R.drawable.star , R.drawable.star , R.drawable.star , R.drawable.star };
    public  static  int img5[]={
            R.drawable.errostar, R.drawable.halfstar, R.drawable.errostar, R.drawable.errostar, R.drawable.halfstar,
            R.drawable.halfstar, R.drawable.halfstar, R.drawable.star, R.drawable.star, R.drawable.errostar,
            R.drawable.errostar , R.drawable.errostar , R.drawable.errostar, R.drawable.errostar, R.drawable.star,
            R.drawable.halfstar, R.drawable.errostar, R.drawable.errostar , R.drawable.star , R.drawable.halfstar   };
    //文字资源（游戏名）
    public  static   String title[]={
            "火花人生","阿尔托的奥德赛","部落冲突","Hyperscape","放置江湖：隐世门派",
            "Slim Ring","航海王：燃烧意志","密室逃脱绝境系列3","月圆之夜", "元气骑士",
            "第五人格","万象物语","绝地求生：全军出击","荒岛求生","兵者",
            "炉石传说","牧羊人之心","FIFA足球世界","同步音律","崩坏3"};

    public  static  String date[]={
            "益智","冒险","策略","冒险","文字",
            "光影","回合制","解谜","卡牌","Roguelike",
            "逃生","养成","吃鸡","生存","益智",
            "暴雪","养成","足球","洛天依","二次元"};

    public  static  String date2[]={
            "解谜","动作","建造","动作","武侠",
            "炫彩","逃脱","","单机","像素",
            "联机","角色扮演","绝地求生","多人", "策略",
            "CCG","魔物娘","体育","音游","打击感"};

    public  static  String date3[]={
            "","","战争","","",
            "","PUBG","","动作","",
            "Roguelike","RPG","生存","文字","象棋",
            "策略","模拟经营","模拟","二次元","美少女"};

    public  static  String  data5[]={
            "","","","","",
            "","","","","",
            "多人","","","冒险","冒险",
            "烧脑","","","","",""};

    public  static  String  data4[]={
            "7.8","9.3","7.5","7.1","8.7",
            "8.7","8.5","8.8","9.5","9.7",
            "8.2","8.3","7.5","8.4","9.5",
            "9.1","8.6","8.5","9.7","8.6"};

    public  static  String  data6[]={"" +
            "爆竹的生活并不容易!","探索无尽的沙漠","为了王室而战","一款星光闪闪的速度游戏",
            "嫉恶如仇的侠客世界","掌握炫酷的动作","我是要成为海贼王的男人","绞尽脑汁去寻找出口吧",
            "最为经典的独立卡牌游戏","别样的像素游戏","给你的园丁来个公主抱吧","森罗万象的视觉体验",
            "大吉大利，今晚吃鸡","略有难度的文字冒险的生存游戏","象棋游戏的壳，解谜游戏的心","暴雪出品，必属精品",
            "魔物娘带你开启异世界之旅","真实刺激的足球手游体验","音游圈的高分游戏","氪金游戏，欧皇游戏"};


    public  static  String xiangqingtext2[]={
            "一旦点燃了生命的火花，人生就开始倒计时。\n" +
                    "\n" +
                    "  《火花人生》是一款画面靓丽、讲述爆竹命运的平台游戏。踏上寻找长乐的旅程，传说那是一支导火线从未点燃过的神秘爆竹。不过，人生若无火花,岂不枉来一遭？!",

            "就在地平线的远处有一片雄伟的沙漠，广袤无垠、无人探索。 \n" +
                    "\n" +
                    "与阿尔托和他的朋友们踏上无尽的沙地之旅去发现沙漠的秘密。\n" +
                    "\n" +
                    "翱翔在狂风吹拂的沙丘之上、穿越惊险的峡谷、在远离家乡的奇幻之地探索神秘的寺庙和城市。\n" +
                    "\n" +
                    "在这一路上，你将碾过藤蔓、在热气球上弹跳、攀爬高耸的岩壁、逃脱调皮的狐猴、同时揭开沙漠中的许多谜团。 ",

            "该游戏支持简体中文\n" +
                    "《部落冲突》是一个战争策略类游戏，在这里，你可以：\n" +
                    "•\t将您的村庄打造成固若金汤的堡垒\n" +
                    "•\t组建您自己的军队！野蛮人、弓箭手、野猪骑士、法师、飞龙和其他强大的战士任凭差遣\n",

            "你前进的主要障碍就是自身的天赋。\n" +
                    "\n" +
                    "所以你能跑多远?",

            "【游历再现、经典剧情】\n" +
                    "江湖豪侠悉数登场，酒馆招募与群侠结义，客栈小憩还有奖励。各种武学神功千变万化，战斗阵型即时变换，百余侠客尽显江湖奇缘，激活缘分飙升战力，百余种武学BUFF相生相克，策略战斗指尖胜负。\n" ,

            "Tap and hold to maneuver your way through the ring! Collect gems as you go to unlock all of the different themes.",

            "航路不止，燃梦不熄！《航海王：燃烧意志》为正版授权的ONE PIECE 3D 大型MMO手机游戏。游戏中全3D场景主机级表现，原版殿堂级声优倾情献声，原汁原味体验动画经典剧情!更有实时真人组队同屏回合对战，无限combo畅快对决，完美立体呈现原作动画！重温航海王的热血与感动，尽享最强战斗快感，不容错过的航海之旅等你来冒险！预计2018年上线，小伙伴们整装待发，准备登船吧~",

            "《密室逃脱绝境系列3》，希望大家能继续支持我们的作品。\n" +
                    "密室逃脱之画中仙游戏软件是一款集冒险、解谜、益智，回合制战斗，密室逃脱为一体的手机游戏，游戏包含了十余个画面精美，拥有浓郁中国风特色的场景。",

            "* 一款独立单机游戏\n" +
                    "* 轻度策略卡牌战斗\n" +
                    "* 随机事件探索与冒险\n"+
                    "* 五种职业、四百多张卡牌自由搭配\n" +
                    "* 八十二位神秘莫测的对手等待你的挑战\n" +
                    "* 探险过程中随机触发未知事件\n",

            "特点：\n" +
                    "* 各种奇葩的英雄以及技能。\n" +
                    "* 大量独特的武器等你发现。\n" +
                    "* 随机生成的关卡，每次都有新体验。\n" +
                    "* 独特的NPC，可以与你并肩作战。\n" +
                    "* 自动瞄准功能，再也不怕手残。\n" +
                    "* 无数其他特点，玩玩就知道了！",

            "“遗失的自我，无法踏入同一条河流”\n" +
                    "在庄园之旅中，诸位将扮演一位身份成谜的侦探，根据细枝末节的线索，从离奇的谜团中演绎出自己的探案之路\n" +
                    "——细致入微的剧情代入：以侦探视角抽丝剥茧，从简单上手，到还原一场场精彩的游戏对局\n",

            "顶级手游大厂雷亚诚意之作\n" +
                    "\n" +
                    "《万象物语》是台湾著名手游厂商雷亚历时四年精心打造的收款角色扮演游戏。此前雷亚皆以音乐游戏广为人知，《万象物语》则是其在首个动作手游《聚爆》取得成功后在角色扮演领域展开的新的尝试。游戏保持了雷亚游戏一贯的超高水准，每一个要素都力求完美，在将音乐元素与游戏画面结合的丰富经验基础上，通过引人入胜的丰富剧情及匠心打造的视觉盛宴，期望带给玩家最极致的游戏体验。",

            "本作为腾讯天美工作室群与韩国蓝洞共同推出的《绝地求生》官方正版虚幻4引擎手游。",

            "发现这片荒野的每个秘密，\n" +
                    "走过这片荒野的每个角落，\n" +
                    "看到这个世界的每个细节。\n"+
                    "新地图新角色新剧情绝赞制作中！！！！",

            "《兵者》是一款关于象棋和兵法的独立解谜游戏。在游戏中，玩家只能控制最弱小的棋子“兵”，去对抗强大的车马炮，吃掉敌人的老将。幸运的是，你的敌人并没有智能，他们只会在可以吃你的时候移动。通过小兵之间的配合、牺牲、诱敌，最终获取胜利，体会小兵也能逆袭车马炮征服帅将军的成就感。",

            "勇敢的英雄请当心，你已踏入危险之地……《炉石传说》渡鸦年首个扩展包“女巫森林”现已上市！这一次，英雄们来到了吉尔尼斯城外的黑樟林，一片被女巫哈加莎诅咒的土地，他们要面对的，是前所未见的恐怖生物，和月光下的黑暗魔法。",

            "【魔物娘收集与养成】\n" +
                    "从一个蛋开始培育自己独一无二的魔物娘，多达60余种不同魔物（不断添加中）在路上等待着您！\n" +
                    "【休闲的牧场建设】\n" +
                    "成为驯养师，建设自己专属的魔物牧场！自由建设+改造，多种风格随心搭配！\n",

            "进攻取胜\n" +
                    "在对战进攻模式中，进入完全进攻的状态，挑战紧张刺激的比赛。 这种创新的比赛让您体验更高境界的玩法，让您在90秒的赛事争冠、攀爬排行榜，并赚取全年都有的赛季奖励。\n" +
                    "跟进真实世界赛事\n" +
                    "了解世界各地正在进行的真实世界足球赛的最新动态。 在单人赛季模式中考验您的实力，然后以独特主题赛事挑战自己，赢取丰富奖品",

            "各位玩家老爷元宵节快乐！！\n" +
                    "喵赛克1.9.1更新来辣！现已包含155首乐曲！\n" +
                    "追加拜年祭热曲《逆浪千秋》《Journey》（小伙伴限定）\n" +
                    "优化和风主题界面视觉效果，减弱判定文字的遮挡\n" +
                    "修复已确认BUG",

            "【天命之战】\n" +
                    "全体部队作战准备…集中所有火力，占领天命总部第三空港！\n" +
                    "逆天命而行，是为信仰之战。\n" +
                    "决绝的牺牲，无悔的托付…以及宿命的重逢。\n" +
                    "“就算变成律者，我也绝不会抛下你…就像你也从未抛弃过我一样！”"
    };





    public  static  String xiangqingtext4[]={
            "《火花人生》是一款画面非常唯美的休闲手游。游戏中玩家将扮演一个被点燃引线的爆竹在指定时间内要跑到终点，当然路上会有各种障碍或者沟壑，玩家必须眼疾手快使出十八般武功才能取得最好的成绩！感兴趣的小伙伴不妨下载试玩一番！\n" +
                    "\n" +"Welcome to the 爆竹世界\n" +
                    "在这个瞬然易逝的烟花纷飞的世界里，寻找属于自己的芳华" ,

            "2015年曾经在双平台上推出的人气冒险游戏《阿尔托的冒险》的续作，《阿尔托的奥德赛》是一款延续“Alto”冒险故事的新旅程，踏上无尽的沙地之旅去发现沙漠的秘密。",

            "广受玩家喜爱的基地经营与策略游戏，合理地部署自己的基地以防御对手偷袭，强大自己的军队掠取对手的资源。",

            "在7个带有钉刺和炸弹的致命场景中奔跑。极限测试你的反应能力。点得不够快，死得够难看！\n" +
                    "\n" +
                    "• 免费游戏!\n" +
                    "• 收集钻石。拿起护盾。拥有hyperspeed。\n" +
                    "• 50多个角色可供选择。\n" +
                    "• 最简单的屏幕单击玩法。但是乐趣无穷。\n" +
                    "• 保持新鲜。每局游戏都是自动生成的游戏场景。\n" +
                    "• 每个区域都有或复古或现代的synthwave游戏音乐。\n" +
                    "• 在Game Center上挑战你的好友。",

            "《乱世侠客令》一款古龙全系列正版授权、硬派复古武侠手游，集古龙先生70余部武侠巨作，其经典剧情原汁还原、多职业策略玩法斗智斗勇，真实、热血的浪子江湖! 致敬东方文化大师，古龙系列扛鼎代表作，原汁原味还原每个人心中的古龙梦! 长剑醉，浪子归，你的江湖浪子路即刻启程!经典武侠故事再次展开，刀光剑影之间呈现经典武林！",

            "Tap and hold to maneuver your way through the ring! Collect gems as you go to unlock all of the different themes.",

            "亲爱的船长们，感谢您的关注与厚爱，对产品满满的期待与建议，悉数收到，项目正在加班加点调优产品，据悉不久之后即将面世，诚邀预约关注。匠心之作，诚意之品，定要带给你不一样的航海之旅。你交给我们的海贼情感寄托，怎舍得让你失望。砥砺前行！！！",

            "密室逃脱之画中仙游戏软件是一款集冒险、解谜、益智，回合制战斗，密室逃脱为一体的手机游戏，游戏包含了十余个画面精美，拥有浓郁中国风特色的场景，包含了华容道，找茬，连连看等经典的益智类小游戏，充满各种中国传统文化元素。\n" +
                    "玩家在游戏中需要从不同的场景中寻找有用的线索，解开一个个谜题，完成各种小游戏，推进故事线的发展，体验中国传统文化中琴棋书画的魅力，见证四大发明的智慧。",


            "小红帽从小就与外婆相依为命，但不幸的是有一天外婆神秘失踪。\n" +
                    "根据警卫队的调查结果显示：他们最后的线索都停留在黑森林。\n" +
                    "为了寻找唯一的亲人，小红帽孤身一人前往黑森林，这一天正是月圆之夜，她即将面对的是守护森林的精灵、凶残的狼人、隐居的女巫以及慢慢浮出水面的真相…",

            "“世界危在旦夕，时间处于剑与魔法的时代，维持世界平衡的魔法石被拥有高科技的外星生物夺走了，你能否夺回魔法石拯救这个世界？”\n" +
                    "\n" +
                    "故事我们实在编不下去了，就是想做一个丧心病狂打怪兽的游戏！\n" +
                    "\n" +
                    "我们相信这就是你潜意识中一直渴望的那个游戏！探索地牢，收集各种奇异的武器，然后丧心病的战爆小怪兽！超级简单，超级直觉的操作，流畅又有趣的游戏体验，外加一些rogue-like元素，至今手机上能找到的最好的射击游戏。",

            "《第五人格》是网易首款非对称性对抗竞技手游。荒诞哥特画风，悬疑烧脑剧情，刺激的1V4对抗玩法，都将给玩家带来全新的游戏体验。玩家将扮演侦探奥尔菲斯，在收到一封神秘的委托信后，进入恶名昭著的庄园调查一件失踪案。在进行证据调查过程中，玩家扮演的奥尔菲斯将采用演绎法，对案情进行回顾。在案情回顾时，玩家可以选择扮演监管者或求生者，展开激烈的对抗。而在调查的过程，无限接近事实时，却发现越来越不可思议的真相。\n",

            "《万象物语》（Sdorica）是由台湾著名手游厂商雷亚游戏历时四年精心打造、龙源网络代理发行的一款唯美幻想风角色扮演手游。清新唯美的日式幻想风格，搭配全程交响乐实录的极致效果，围绕六大种族交织的庞大世界观，向玩家展示了一个瑰丽多彩的奇幻世界。游戏采用了策略+消除的独特战斗玩法，玩家将以一位谛视者的身份，引领超过三十位独具特色的角色，在极致的视听盛宴陪伴下，一步步探索凡泰缇大陆过去、现在与未来的历史。",

            "躺着也能玩绝地求生？PUBG&天美联合出品的正版绝地求生手游《绝地求生 全军出击》帮你实现！\n" +
                    "【全面还原，应有尽有】\n" +
                    "顶级UE4引擎全面还原端游大世界，军事基地、Y城、98k、8倍镜...你熟悉的东西这里应有尽有。\n" +
                    "【手机虽小，乐趣不减】\n" +
                    "人物动作、全系列武器手感经过打磨调优，带给你顺畅的操作体验。就算躺在床上，也能体验100%的游戏乐趣。\n" +
                    "【单排组队，只争第一】\n" +
                    "100人公平竞技，在公平的战斗中大展拳脚，享受竞技的乐趣！\n" +
                    "大吉大利，今晚第一！",

            "荒野上的求生。\n" +
                    "略有难度的文字冒险生存游戏。\n" +
                    "玩家在游戏中扮演一个出海遭遇事故从而流落到无人荒野的角色。\n" +
                    "\n" +
                    "玩家需要在荒岛上学习求生技巧，\n" +
                    "保证自己能够在恶劣的环境中生存下来，\n" +
                    "并在此前提下，探索荒岛中隐藏的秘密，\n" +
                    "并最终逃离出荒岛回到文明世界。\n" +
                    "\n" +
                    "游戏没有复杂操作，\n" +
                    "只需点击就可以完成相应行动。\n" +
                    "通过建立营地，采集物资，与荒野对抗，\n" +
                    "考验你对时间的掌控和计划的安排。\n" +
                    "\n" +
                    "厨师罗兰的信念，\n" +
                    "老贝的军人精神，\n" +
                    "冰山女爵士朱莉，\n" +
                    "美食达人野食小哥，\n" +
                    "甚至还有船长基德，\n" +
                    "\n" +
                    "都会给你带来不一样的体验！",

            "*原汁原味的中国象棋文化，所有棋子的规则都和象棋完全一致，上手简单容易\n" +
                    "*游戏内容里并无高深的象棋博弈技巧，与象棋水平高低并无关系，只需了解规则就可轻松畅玩\n" +
                    "*丰富多彩的游戏规则，远远超脱象棋的束缚，兵者，绝不仅仅是象棋\n" +
                    "*浓郁的古代兵法氛围，每一关都对应三十六计中的一计，熟知兵法助你百战百胜\n" +
                    "*画面简洁干净，背景使用了徐悲鸿、蒋兆和、董寿平、傅抱石等国画大师的作品，完美体现中国传统文化",

            "不可思议的简单。难以置信的有趣。\n" +
                    "\n" +
                    "挑选您的卡牌来战个痛快吧！在《炉石传说》这款节奏明快的游戏中，您将扮演一位英雄机智地使用各种策略，在持续若干分钟的对战中，通过打出各种威力强大的卡牌来施放法术、召唤随从来夺取这变幻莫测的战局的控制权。无论您是第一次玩卡牌游戏，还是已经是卡牌游戏老手，《炉石传说》所蕴含的游戏深度和魅力都将让您欲罢不能。\n" +
                    "\n" +
                    "一玩即会: 充满趣味的初始任务会带您立即感受《炉石传说》最为纯粹的游戏魅力。\n" +
                    "\n" +
                    "打造套牌:有上千张可以赢得和制作的卡牌——玩得越久，属于您的卡牌也就越多。\n" +
                    "\n" +
                    "切磋牌艺： 在练习赛中与电脑控制的魔兽英雄们对战。萨尔、乌瑟尔、古尔丹——他们都在这儿！\n" +
                    "\n" +
                    "卡牌收藏在线存储：您的卡牌收藏与您的战网通行证相绑定——这使得您可以随意选择平板设备或PC进行游戏。\n" +
                    "\n" +
                    "一战成名：当您感觉自己具备一定实力时，迈入竞技场与其他玩家一较高下，争取赢得大奖的机会！\n" +
                    "\n" +
                    "需要至少2GB的硬盘空间才能安装《炉石传说》\n" +
                    "\n" +
                    "支持语言：\n" +
                    "* English\n" +
                    "* Français\n" +
                    "* Deutsch\n" +
                    "* Español (Latinoamérica)\n" +
                    "* Español (Europa)\n" +
                    "* Italiano\n" +
                    "* Português\n" +
                    "* Polski\n" +
                    "* Русский\n" +
                    "* 한국어\n" +
                    "* 简体中文\n" +
                    "* 繁體中文\n" +
                    "* 日本語 \n" +
                    "* ไทย (泰文) \n" +
                    "\n" +
                    "©2017 暴雪娱乐股份有限公司版权所有。炉石传说，战网与Blizzard Entertainment是暴雪娱乐股份有限公司在美国和(或)其它国家的商标或注册商标。",

            "卡露蒂亚•朵阿贝，“牧羊人之心”，在这片广袤大地上生营的人类先祖语言中，它是“家”的象征，是的，卡露蒂亚，就是这块大陆的名字。这里，魔物和人类共同生活。\n" +
                    "“我会成为最厉害的驯养师！”\n" +
                    "少年和少女从此踏上旅途~\n" +
                    "\n",

            "《FIFA Mobile》已重新设计，将为您带来最真实、刺激的足球手游体验！ 获取一项免费Cristiano Ronaldo物品，即可开始打造和管理您的球队。 将任意球员训练到足球巨星水平、向对手发起进攻，并在全赛季期间每日查看新内容。 另外，游戏的安装包小于100 MB，可让您快速下载游戏。 不论您是一名久经沙场的高手或是一名刚入球场的懵懂新手，《FIFA Mobile》都是可以满足您的足球游戏。\n" +
                    "\n" +
                    "打造您的ULTIMATE TEAM™\n" +
                    "在超过550组球队中，任意选择11名球员（包括以往以及现役球星），打造最具竞争力的阵容，并将他们训练至超过100总评。 为您的名单加入更多不同的球员、随时管理您的阵容，并在每场比赛开始前，迅速调整战术。 做出正确的决定，见证您的俱乐部成为Ultimate Team。",

            "由年轻艺术家们创作的独立音乐游戏来！辣！\n" +
                    "\n" +
                    "你将穿梭在萌萌哒海洋，广阔的天空或是深邃的时空隧道中。\n" +
                    "与乐曲情节相符的演出效果为您展现音乐的情感变化。 \n" +
                    "让您在美妙的音乐中找到最初的感动！ \n" +
                    "\n" +
                    "任性的操作方式！(≧Д≦)ノ \n" +
                    "喵赛克能精准的捕捉您的每一次触碰， \n" +
                    "无论屏幕大小， 无论手指粗细， \n" +
                    "您都可以流畅的进行演奏， \n" +
                    "伸出双手尽情的敲击屏幕吧！ \n" +
                    "\n" +
                    "终极的听觉享受！(*≧ω≦) \n" +
                    "纯净的钢琴，酷炫的电音。\n" +
                    "您的每一次触碰让都会有美妙的音符从您的指尖流出， \n" +
                    "让您体验真实的演奏的乐趣！ \n" +
                    "专业的声音处理和高品质的音频让您的耳机燃烧起来！\n" +
                    "\n" +
                    "细腻的打击手感！o(≧w≦o)、 \n" +
                    "钢琴的清澈， 电音的颗粒， 古琴的律动， \n" +
                    "为不同风格音乐而定制的演奏特效让您的手指仿佛可以触碰音乐！ \n" +
                    "\n" +
                    "永不停止的更新！(≧o≦)ノ\n" +
                    "只要中国音乐人不停止创作， 喵赛克的更新也将继续！ \n" +
                    "喵赛克将追随他们的脚步， 向前迈进！ 永不停止！",

            "美术品质为同类游戏的佼佼者，视觉包装为业界典范。\n" +
                    "——许慕典《光影对决》制作人\n" +
                    "\n" +
                    "只看一眼就被征服。\n" +
                    "——邓梁 游戏葡萄主编\n" +
                    "\n" +
                    "其美术和动画效果在国内手游中堪称高水准。\n" +
                    "——楚云帆 游研社创始人\n" +
                    "\n" +
                    "「崩坏3」点燃ACG动作之魂! 次世代的动作游戏出击！——教科书式的3D全视角卡通渲染、蜜汁沉浸的关卡剧情、熟练可调戏的看板萌妹、无限可能的分支连招，以及不科学的超强打击感！作为天朝原创IP大作，更有中日人气声优献声哟~！撒，与女武神并肩作战，一起抵抗「崩坏」吧！\n" +
                    "\n" +
                    "PS：为了社区的环境，请将邀请码分享到版区专帖：https://www.taptap.com/topic/60227\n" +
                    "崩坏3官网&TapTap通兑礼包码：EUSPDS5T97，请在游戏内兑换使用（礼包码与官方微信号领取的“爱酱的零花钱”属于同一批，每个玩家只能使用一次，安卓和iOS版都可以使用）"
    };

}
