package com.example.l.wanshaapp.Rankingtools;

import com.example.l.wanshaapp.R;

;

/**
 * Created by 侯顺发 on 2018/5/24.
 */

public class TwoFragmentTools {

    //图片资源
    public  static  int img[] = {
            R.drawable.rankingnew_01, R.drawable.rankinghot_08, R.drawable.rankinghot_18, R.drawable.rankingnew_04, R.drawable.rankingnew_05,
            R.drawable.rankingnew_06, R.drawable.rankingnew_07, R.drawable.rankingnew_08, R.drawable.rankingnew_09, R.drawable.rankingnew_10,
            R.drawable.rankingnew_11 , R.drawable.rankingnew_12 , R.drawable.rankingnew_13 ,R.drawable.rankingnew_14 , R.drawable.rankingnew_15 ,
            R.drawable.rankingnew_16, R.drawable.rankingnew_17 , R.drawable.rankingnew_18 , R.drawable.rankingnew_19 , R.drawable.rankingnew_20
    };
    public  static  int img1[]={
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star, R.drawable.star,
            R.drawable.star , R.drawable.star , R.drawable.star, R.drawable.star , R.drawable.star,
            R.drawable.star , R.drawable.star , R.drawable.star , R.drawable.star , R.drawable.star  };
    public  static  int img5[]={R.drawable.errostar, R.drawable.halfstar, R.drawable.errostar,
            R.drawable.errostar, R.drawable.halfstar, R.drawable.halfstar, R.drawable.halfstar,
            R.drawable.star, R.drawable.star, R.drawable.errostar, R.drawable.errostar ,
            R.drawable.errostar , R.drawable.errostar, R.drawable.errostar, R.drawable.star,
            R.drawable.halfstar, R.drawable.errostar, R.drawable.errostar , R.drawable.star , R.drawable.halfstar    };
    //文字资源（游戏名）
    public  static   String title[]={
            "疯狂兔子：无敌跑跑","密室逃脱绝境系列3","FIFA足球世界","影之诗","乱斗堂3:重生",
            "篮球经理","战国志","拳皇命运","魔方时空：疯狂记忆", "太古神王：星魂觉醒",
            "决战地下城","幻宠学院","生化感染","涂游中国象棋", "中土纪元",
            "天芒之神","球王之路","逗三国","全民宫斗","金球制胜"};
    public  static  String date[]={
            "竞速","解谜","足球","TCG","角色扮演",
            "体育","MMORPG","格斗","益智","MMO",
            "","经营","动作","象棋","RPG",
            "RPG", "模拟","三国","养成","体育"};

    public  static  String date2[]={
            "跑酷","逃脱","体育","二次元","回合制",
            "模拟","角色扮演","动作","竞技","幻想",
            "","养成","","","",
            "","体育","","经营","足球"};

    public  static  String date3[]={
            "","古风","模拟","卡牌","挂机",
            "篮球","多人","","玄幻","",
            "","","","","",
            "","足球","","","竞技"};

    public  static  String  date5[]={
            "","","","CCG","",
            "","","","","",
            "","","","","",
            "","","","","",""};

    public  static  String  data4[]={
            "7.1","8.8","7.7","7.8","7.2",
            "8.8","8.5","8.7","9.9","9.2",
            "8.3","8.5","7.0","8.4","9.5",
            "9.2","8.5","8.8","9.3","8.8"};

    public  static  String  data6[]={
            "各种奇葩道具等你来解锁","绞尽脑汁去寻找出口吧","真实刺激的足球手游体验","日式幻想卡牌对战手游",
            "二次元炫技萌斗手游", "模拟养成经理类的肝帝手游","全球同服争霸，成为一代枭雄吧","拳皇经典焕新登场",
            "首款异性魔方智能手游", "身负神王血脉，一键觉醒超炫变身", "超多经典的副本BOSS","魔幻版宠物小精灵",
            "生存或者死亡，你对恐惧一无所知","快速提升你的象棋技巧", "四大种族六大职业供你选择，去成为王吧", "公会战场全天候激情战斗",
            "FIFPro官方正版授权","率领一众武将与敌人征战沙场","一入豪门深似海，步步危机","不需要动脑子的好游戏"};

    public static  String xiangqingvideo[]={
            "http://ghc48.aipai.com/user/668/33768668/6240107/card/48158248/card.mp4?l=a",
            "",
            "http://vod.cdn1.v.17173.com/0ad4006e0912e38b001b67918f495b00e6797ad09f0031b2/cx2/FLVList/20180602/1/72453965_38876995_1.mp4",
            "http://vod.cdn1.v.17173.com/0ad400980912e38b001b67918f495b00e6797ad09f0031b2/cx2/FLVList/20180425/1/137644358_38871724_1.mp4",
            "",
            "",
            "http://vod.cdn1.v.17173.com/2954003b7b3f772a001b6e10964c5b00cd10d5aba00055b4/cx2/FLVList/20180608/1/129967111_38877830_1.mp4",
            "http://vod.cdn1.v.17173.com/0ad4006d0912e38b001b67918f495b00e6797ad0a00031b2/cx2/FLVList/20180607/1/129967111_38877641_1.mp4",
            "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""

    };

    public  static  String xiangqingtext2[]={
            "这款游戏采用了竖版3D模式呈现，游戏的色彩分明。我们的主角是一只非常搞怪的兔子，它拥有愚笨的身材，与传统可爱兔子还是有一定差距，最吸引玩家的的是它那一副傻呵呵的表情，看见了就想笑。",

            "《密室逃脱绝境系列3》，希望大家能继续支持我们的作品。\n" +
                    "密室逃脱之画中仙游戏软件是一款集冒险、解谜、益智，回合制战斗，密室逃脱为一体的手机游戏，游戏包含了十余个画面精美，拥有浓郁中国风特色的场景。",


            "进攻取胜\n" +
                    "在对战进攻模式中，进入完全进攻的状态，挑战紧张刺激的比赛。 这种创新的比赛让您体验更高境界的玩法，让您在90秒的赛事争冠、攀爬排行榜，并赚取全年都有的赛季奖励。\n" +
                    "跟进真实世界赛事\n" +
                    "了解世界各地正在进行的真实世界足球赛的最新动态。 在单人赛季模式中考验您的实力，然后以独特主题赛事挑战自己，赢取丰富奖品",

            "《影之诗》 (Shadowverse)是由日本Cygames公司开发的一款日式幻想题材卡牌对战手游。本游戏拥有丰富的战略、独特的进化系统、强竞技性的玩法、华丽的卡牌立绘、上百位超人气声优及原汁原味的日式幻想故事，让玩家在畅快对战同时，在日式幻想大世界中尽享视觉的饕鬄盛宴。",

            "《乱斗堂3》是一款二次元炫技萌斗手游。游戏采用了放置式RPG+回合对战的模式，40余种效果炫丽的技能+上百个激萌个性的角色形象，任意搭配出数百种不同的战斗流派。更有玩家间实时组队PVE&PVP挑战、好友趣味互动、天下第一武道大会、3V3排位赛、地下乱斗场等丰富互动玩法，新鲜、烧脑、不氪、耐玩是我们全力为玩家们带来的游戏体验！",

            "你是否找寻过一款真正的篮球经理游戏？\n" +
                    "——我是说不肝体力，不合成球员，不收集装备碎片的那种，真正的经理游戏？\n" +
                    "你是否梦想过带领你亲自挖掘的年轻人征战球场？\n" +
                    "你是否曾在脑海中构思过无数精妙的战术并渴望实现？\n" +
                    "我们有最好的球员养成系统，因材施教，让球员成长你想象中的模样！\n" +
                    "我们有最真实的游戏引擎，挡拆、突破分球、空切，在我们的游戏中，这一切不再是空想！\n" +
                    "我们有最合理的交易系统，按照你最真实的想法构建球队！\n" +
                    "我们有来自世界各地的玩家，可以与你约战，每天切磋技艺！\n" +
                    "\n" +
                    "教练，我想打篮球！",

            "网易《战国志》是一款全球同服争霸手游。游戏以春秋战国时代为背景，将军可在乱世中与来自东南亚、韩国、港澳台的兄弟对战，同仇敌忾保家卫国！六种语言随心翻译，体验真实战国外交。五大职业独具特色，六大副职业让任凭手艺暴富。奇袭敌军，立体攻城，跟随指挥体验五国激情对战。游戏以气势恢宏的战国写实画面、全球同服的万人PVP战斗体验，让各位将军置身于群雄逐鹿、风云诡谲的战国乱世，揭竿而起，从战场小卒成长为一代枭雄！风起云涌，是为战国，犯我疆域者，虽远必诛！",

            "《拳皇命运》是由腾讯游戏独家代理发行，银汉游戏倾力打造的SNK正版授权拳皇格斗手游！拳皇经典焕新登场，格斗之魂永不熄灭！人气格斗家强势云集，打造KOF公平竞技，创新3V3多人对战，再现街机激爽闯关，体验百分百热血真格斗！\n",

            "魔方时空是魔际形云公司研发的首款异形魔方智能手游，集教学、竞技、社交为一体，纯三维动态展示，是魔友可以互动交流的益智魔方游戏平台。",

            "原作者净无痕强力推荐，400万忠实读者倾情期待，正版授权史诗玄幻3DMMO手游《太古神王：星魂觉醒》震撼来袭！身负神王血脉，一键觉醒超炫变身；巨型玄幻世界，360°自由翱翔；四大职业体系，五次转职突破；时装武器自主设计，神兽坐骑、华丽羽翼、上古神兵自由搭配，帮派混战畅爽PK，尽享拉风修仙！",

            "魔幻之巅，燃情厮杀，海量英雄搭配，2018年全新魔幻回合制挂机放置类手游！超多经典的副本BOSS，3大PVP系统跨服争霸。全程战斗酸爽不停歇，上班、睡觉也能玩！完美还原魔幻经典，流畅的战斗，多姿多彩的技能动作，让你爽不停！小伙伴们还在等什么？现在就加入游戏，展开神奇的探索旅程吧！",

            "《幻宠学院》是一款3D魔幻风的养成策略类游戏。玩家会在旅程中不断收集并培育出自己理想的幻宠组成战队与邪恶势力对抗。丰富多彩的PVE和PVP功能都会让个性独特的幻宠在战场上一显身手。赶快加入我们那惊险刺激的旅程，一起迎接那未知的挑战吧！",

            "——————高能预警线——————\n" +
                    "这里有数不尽的丧尸和怪物\n" +
                    "甚至从小照顾你长大的导师也站在了你的对立面\n" +
                    "在无边的尸潮中奋战，只为重燃文明的火种\n" +
                    "生存还是死亡，有你来决定\n" +
                    "菜鸟们颤抖吧，相信我，你对恐惧一无所知！",

            "揭棋赛闪亮上线，赛出你的水平！\n" +
                    "超热门的象棋游戏《途游中国象棋》，百万象棋用户的首选，\n" +
                    "这里有超嗨超精彩的高手对决！\n" +
                    "全天时比赛，每日开奖，各类大奖等你来拿！\n" +
                    "\n" +
                    "《途游中国象棋》是一款老少皆宜，适合全民天天玩的经典棋牌游戏。支持单机象棋和联网象棋自由选择，人机和双人对抗具备超强趣味性！",

            "中土大世界，国战新纪元！《中土纪元》是由巅峰互动研发的一款开放式轻国战3D MMO手游。游戏展现沉浸式的中土广袤魔幻大世界，完美呈现次世代电影级画面；四大种族六大职业供选择，3D全自由无锁视角移动战斗；千人同屏六国纷争，再现中世纪时期对抗血战场面；更有英魂再造神戒养成系统，多样PVP活动，百变时装套装、稳定交易系统以及丰富社交互动，真实感受超高自由度的手游乐趣。",

            "神界-庆典充值  6月1日-6月2日\n" +
                    "\n" +
                    "（超炫羽翼，海量橙装材料，精灵套装等超丰厚材料等您来拿）\n"+
                    "神界-庆典商人（每日消耗相应体力即可获取特惠购买材料资格）\n" +
                    "\n" +
                    "特别注意：该活动因显示问题，活动内为领取，实际领取会扣除相应钻石",


            "拥有FIFPro官方正版授权，与超级足球经理一起运营您的足球团队，打造卓越的整容和训练您的球员，发挥您的策略战术打败竞争对手和获得冠军杯联赛。一起加入成为最有价值的足球经理吧！",

            "玩家化身主公大人，海量三国武将，造型百变各有千秋，可自由搭配武将，并率领一众武将与敌将征战沙场，加上多彩炫丽的技能，让玩家享受最炫丽的战斗画面，结合多种战斗形式，让玩家间有充分的交互和竞争。",

            "《全民宫斗》手游是一款唐朝朝模拟经营养成，皇子争斗手机游戏，一入豪门深似海，处处机关，步步为营，弱肉强食，只要你愿意，即可大权独揽，坐享天下美人 ！游戏内不仅可以体会到家族结盟、联盟争霸、门客培养、衙门风云、宾客盈门、出游寻访，冲榜称王，副本抗衡，多人社交等精彩玩法。\n" +
                    "手游《全民宫斗》中栩栩如生宫廷的画风，真实领略皇子的日常。视听玩全方位让您亲身感受一把刻骨铭心的古风生活。告别无趣的刷怪升级，来一场明争暗斗的官场争斗!健全的官职升迁系统，体验青云直上的快感!",

            "氪金游戏，欧皇游戏",



    };





    public  static  String xiangqingtext4[]={
            "育碧最蠢萌的兔子来了！它们心中一直有个梦，征服地球月球和太空，就像电影里帅气的超人，所向无敌，披荆斩棘！然而···需要你帮助呆子们利用它们奇葩的运动秋裤，七手购物车，滚筒洗衣机等神奇道具去收集世界各地的饮料罐，存钱实现太空梦！是不是很心酸，有没有很感人！赶快来一场你从未见过的报销跑酷之旅吧！" ,

            "密室逃脱之画中仙游戏软件是一款集冒险、解谜、益智，回合制战斗，密室逃脱为一体的手机游戏，游戏包含了十余个画面精美，拥有浓郁中国风特色的场景，包含了华容道，找茬，连连看等经典的益智类小游戏，充满各种中国传统文化元素。\n" +
                    "玩家在游戏中需要从不同的场景中寻找有用的线索，解开一个个谜题，完成各种小游戏，推进故事线的发展，体验中国传统文化中琴棋书画的魅力，见证四大发明的智慧。",

            "\"   \\\"《FIFA Mobile》已重新设计，将为您带来最真实、刺激的足球手游体验！ 获取一项免费Cristiano Ronaldo物品，即可开始打造和管理您的球队。 将任意球员训练到足球巨星水平、向对手发起进攻，并在全赛季期间每日查看新内容。 另外，游戏的安装包小于100 MB，可让您快速下载游戏。 不论您是一名久经沙场的高手或是一名刚入球场的懵懂新手，《FIFA Mobile》都是可以满足您的足球游戏。\\\\n\\\" +\\n\" +\n" +
                    "                    \"                    \\\"\\\\n\\\" +\\n\" +\n" +
                    "                    \"                    \\\"打造您的ULTIMATE TEAM™\\\\n\\\" +\\n\" +\n" +
                    "                    \"                    \\\"在超过550组球队中，任意选择11名球员（包括以往以及现役球星），打造最具竞争力的阵容，并将他们训练至超过100总评。 为您的名单加入更多不同的球员、随时管理您的阵容，并在每场比赛开始前，迅速调整战术。 做出正确的决定，见证您的俱乐部成为Ultimate Team。\\\",\\n\",",

            "各位主战者大家好，\n" +
                    "\n" +
                    "《影之诗》国服将于4月27日登陆App Store，并将于5月4日正式开启双平台公测！\n" +
                    "\n" +
                    "《影之诗》官网预约人数目前已经突破180万，丰厚的预约奖励将在开服后第一时间送到各位的手中~\n" +
                    "同时，国服还为玩家提供了丰厚的新手福利，只要通过新手教程，即可获赠50卡包券的奖励，以方便玩家们尽快搭配出心仪的卡组。\n" +
                    "\n" +
                    "此外，网易国服官方更贴心为大家准备了更多重磅的国服专属福利！\n" +
                    "通过参与角色应援活动以及官网预约活动，玩家即可获得免费虹卡、金币和卡包券奖励，更有机会获得国服预约专属头像和称号！\n" +
                    "\n" +
                    "除此之外，网易官方更是联合了Cygames特别推出了国服专属皮肤，让《影之诗》国服的玩家们，能够以不一样的形象，开启国服的对战之旅。\n" +
                    "\n" +
                    "记得时刻关注《影之诗》和本调戏专员的最新动态，获取更多国服公测资讯哦！",

            "【二次元群星大乱斗】\n" +
                    "上百套激萌的变身角色外套，个性十足，天赋属性迥异，满足你对角色扮演的一切想法！\n" +
                    "\n" +
                    "【数百种技能流派搭配】\n" +
                    "10大系别40余种特性迥异的技能，任意搭配出数百种不同特性的战斗流派，自由策略超烧脑，拒绝无脑氪金游戏！\n" +
                    "\n" +
                    "【协力逗趣社交互动】\n" +
                    "实时组队副本、修炼打劫切磋、趣味奴隶争夺、粮食生产协力加速、精彩战斗录像分享点评等超多好友社交玩法，独乱斗不如众乱斗！\n" +
                    "\n" +
                    "【公平竞技大比武】\n" +
                    "天下第一武道大会、武道场、地下乱斗场等一系列PVP玩法提供你与各路格斗家一较高下的机会，3V3排位赛更采用了公平竞技对战模式，拒绝氪金、只烧脑！\n" +
                    "\n" +
                    "【睡觉升级可躺赢】\n" +
                    "在PVE成长方面，游戏内置了离线挂机系统，7*24小时无休，连睡觉时间也在升级，让你在繁忙无法上线时也能保持不间断的游戏成长！",

            "喜欢篮球经理游戏，就玩《篮球经理》。\n" +
                    "开发组老大是BuzzerBeater前世界冠军，到过世界的顶峰，知道什么才是真正的篮球经理游戏。最有爱的人，做全世界最好玩的篮球经理游戏，请不要怀疑我们的格局~\n" +
                    "虽然很多大佬已经玩很嗨了，但是你知道吗？当前版本还不是完全体，每个赛季都会有大量的系统功能更新和bug修复。\n" +
                    "一路有你，砥砺前行，欢迎有问题在评论区留言或者去论坛发帖，bug承诺解决，好的建议经过论证，也会采纳，希望大家活跃起来，帝小江无处不在。\n" +
                    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" +
                    "安卓-点击官网下载\n" +
                    "苹果-苹果商店搜索 BCM，排名第一的BCM篮球经理，或者直接点击上面的苹果按钮\n" +
                    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" +
                    "游戏本来要叫《篮球经理》的，因为中国大陆唯一著作权是我们的，但是名字被无情霸占了，我们也在努力申诉中~加油~~\n" +
                    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" +
                    "我们是狂热的篮球发烧友，每周一场球。\n" +
                    "放眼世界，众多篮球经理游戏，一个能打的都没有！\n" +
                    "这事都没人管管？\n" +
                    "我们每天都在思考这样一些问题——\n" +
                    "“如何把挡拆、突破分球、空切等球场里每天都在发生的战术做进游戏？”\n" +
                    "“如何模拟真实打球的感觉？”\n" +
                    "卧薪尝胆两年，只为做一款接近真实的篮球经理游戏。\n" +
                    "这游戏就是真实，相信你能感受到，愿小伙伴们能陪伴我们一起成长，让这款游戏成为全世界最真实、最给力的篮球经理游戏，需要你的参与！",

            "各位将军：\n" +
                    "《战国志》5月17日全平台公测！\n" +
                    "\n" +
                    "官网下载地址：http://zgz.163.com/m/fab/fzy\n" +
                    "\n" +
                    "自2017年6月1日揭竿首测以来，《战国志》已经伴随将军们走过将近一个年头。在此期间，开发组吸取了来自各位将军的宝贵建议，针对职业平衡、国战玩法、社交系统以及闪退卡顿等问题不断进行优化，而这一次公测，我们做了有史以来最大的改变，以期为大家呈现：\n" +
                    "——全球同服的自由国战体验。《战国志》此次开放了经典服和国际两种服务器。让各位将军可以同来自世界各地的兄弟们一起，或实施对抗，或并肩作战，感受新一代的国战魅力。同时经典服，仅限大陆玩家进入，对于想体验经典国战对抗的将军来说不容错过。\n" +
                    "——随心翻译的战国外交体验。《战国志》加入了包括中文、韩语、泰语在内的六大语言翻译系统，各位将军可以借此与国际友人随心交流，自由外交。\n" +
                    "——精心打造的唯美战国风光。《战国志》将以国战手游中首屈一指的画面体验，为各位将军呈现一个气势恢宏的战国世界。\n" +
                    "——开放的主职业、副职业搭配。《战国志》不仅设计了兵谋、鬼谷等特色鲜明的五大职业，还加入了包括侯爵、马监、游侠等八大副职业供将军们选择。套马挖矿，驰骋战国。\n" +
                    "\n" +
                    "此外，有很多将军向我们反馈问题，每一条留言我们都仔细阅读，出现的不足我们一定会在之后的更新中不断修正。\n" +
                    "\n" +
                    "【联系我们】\n" +
                    "官方论坛：http://zgz.16163.com\n" +
                    "《战国志》微信公众号：zgz163163\n" +
                    "《战国志》官方QQ群：587483385\n" +
                    "《战国志》微博：#网易战国志手游#",

            "【正版拳皇格斗手游】\n" +
                    "SNK官方授权，完美诠释热血新经典！《拳皇XIV》声优原班人马倾情献声，重温“Ready Go”的燃情对战！\n" +
                    "\n" +
                    "【公平竞技 实时开打】\n" +
                    "3V3组队跨服匹配，开启KOF公平竞技擂台，凭实力争夺最高荣耀，用拳头轰出胜者之路！\n" +
                    "\n" +
                    "【街机体验 超爽还原】\n" +
                    "无限连招，翻滚援护！百分百还原街机格斗暴爽手感，流畅华丽的必杀技连段，毫秒级精准的出招判定，打造移动平台最极致的格斗体验！\n" +
                    "\n" +
                    "【人气格斗家全集结】\n" +
                    "官方同名动画完美复现，与草薙京、八神庵、不知火舞等人气格斗家组队，亲历三神器千年宿命对决，高自由度格斗家养成，组建私家专属最强格斗天团！\n" +
                    "\n" +
                    "【360度沉浸式社交】\n" +
                    "独家首创LBS武道馆模式，开启线下精准定位，随时随地同城约战，街头霸王就是你！",

            "疯狂记忆，100层等你。\n" +
                    "\n" +
                    "每天，给你的大脑做运动。",

            "【游戏特色】\n" +
                    "★电影级3D玄幻大世界★\n" +
                    "原著小说中让四百万读者惊叹的九天神王世界，丰富的世界观架构，充满想象的精彩剧情，通过电影级高清画质华丽再现，360度全视角开放，自由探索3D玄幻天地，体验沉侵式武道修仙！\n" +
                    "\n" +
                    "★拉风修仙 个性百变★\n" +
                    "天生炫酷神翼，上天入地自由飞行；时装、武器随心DIY染色，自定风格拉风修仙，花式实时美拍，秀出你的修仙style！\n" +
                    "\n" +
                    "★激爽PK 兄弟共战★\n" +
                    "野外PK战，试炼BOSS战，势力阵营战，跨服天梯联赛战等数十种战斗模式，丰富的PVP玩法，超华丽XP技能，尽享单挑、组队、团战，兄弟并肩更激爽！\n" +
                    "\n" +
                    "★神器认主 随从守护★\n" +
                    "混沌、远古、诸神等上古神器与神兵，认主对敌一击必杀；囊括人、魔、仙等多个种族随从，陪伴守护共战斗！\n" +
                    "\n" +
                    "★快意仙侠 福利满满★\n" +
                    "开局获取主角光环，体验爽快福利多，超高收益躺着拿，自助修仙不操心，极速超神保送五转，好友组队拥有超高爆率！",

            "《决战地下城》强力公测,开启联盟的英雄大战\n" +
                    "轻松放置类RPG挂机策略游戏《决战地下城》于5月25日进行不删档公测!广大玩家届时可以感受到震撼的体验效果。《决战地下城》携带“时光之穴，黑龙降临，泰坦宝库，英雄远征”四大副本强势归来，赶快下载吧！\n" +
                    "离线打怪，登录即送英雄\n" +
                    "《决战地下城》豪礼大相送，玩家登陆就送史诗英雄。决战地下城延续了联盟的强大世界观，但决战地下城更加考虑玩家的感受，解放双手，挂机也能升级。终于不用在拼命爆肝，熬夜打游戏了。决战地下城是一款放置类的挂机类手游，集合了策略养成等玩法，是一款适合任何年龄的游戏。\n" +
                    "登录即有七日福利，助你快速升级\n" +
                    "决战地下城为给广大玩家最快速，最爽的体验，开服七日，天天福利乐不停！玩家通过游戏，既可以领取价值50RMB的金币，钻石碎片等奖励，也可以在完成所有任务之后，领取游戏为您送上的隐藏大礼英雄豪礼。",

            "游戏发生在童话故事编制而成的幻想世界，玩家会身临其境的与故事中的主人公一起再历他们的劫难。也许你会受命运的安排帮助年轻的王子拯救被困在巫婆手中的公主、或许你会与矮人国中的勇士们一起夺回他们被恶龙侵蚀的家园，从而缔造出真正属于自己的完美童话。\n" +
                    "“幻宠学院”顾名思义，对于幻宠的培育将成为本款游戏的主轴，它们生活在奇幻世界的每一个角落，作为战斗中不可或缺的一员亦是这大家庭中独特的存在，所以对于幻宠的培养是各位训练师必须要掌握的重要技能。游戏中的诸多系统都为幻宠能力的提升添油助力，装备锻造、资质突破、属性修炼和技能附魔4大功能可以让玩家根据自己对战斗的理解与需求随心所欲的培育出符合自己战斗特色且独一无二的幻宠。\n" +
                    "眼前即将发生的一切犹未可知，带上你的幻宠一起进入那五彩斑斓的童话世界，训练师们，你们准备好了吗？",

            "生命意味着束缚，死亡意味着解脱 \n" +
                    "2189年,地球 \n" +
                    "粮食、水、燃油等人类赖以生存的资源变得紧缺。 \n" +
                    "生存的欲望让世界陷入战乱， \n" +
                    "大国掠夺小国，权贵剥削平民，平民相互厮杀。 \n" +
                    "无休止的杀戮下，世界走向崩溃…… \n" +
                    "与此同时，一场以拯救为名的末日审判，悄然展开。 \n" +
                    "无数人死于外星病毒的爆发。 \n" +
                    "但死去的人们，却没有离开这个世界的打算！ \n" +
                    "他们成了行尸走肉；世界成了无间炼狱。 \n" +
                    "而那些在病毒中得以进化者，是人类最后的希望，他们建起无数庇护所， \n" +
                    "在无边的尸潮中奋战，只为重燃文明的火种！ \n" +
                    "人类，覆灭还是救赎，全在你的手中。",

            "1.中国象棋支持人机对弈、人人对弈、联网对弈，超低流量消耗\n" +
                    "2.新中国象棋支持单机玩法，免费的单机游戏，真正的单机中国象棋\n" +
                    "3.200多经典棋局，超强象棋残局大全，快速提升象棋技巧\n" +
                    "4.棋谱功能，支持观战保存棋谱、对弈保存、单机保存等",

            "\n" +
                    "不好好拿自己的游戏内容做广告拿别人的游戏内容做虚假广告就知道是垃圾游戏，在抖音上看到这游戏广告拿失落的方舟宣传视频的内容来做广告，就怒来Tap来搜索来评个1星。最烦游戏虚假广告与游戏内容不符的游戏了。这种拿别的游戏做广告的游戏最垃圾的，说明自己游戏都没内容可拿出来秀。渣渣游戏还拿我最期待的游戏打广告。",

            "《天芒之神》是一款3D动作冒险手游。\n" +
                    "\n" +
                    "【全天候超燃PVP】\n" +
                    "公平竞技场全职业随机匹配。\n" +
                    "百团战场全程激情战斗体验。\n" +
                    "公会战场全天候超燃大乱斗。\n" +
                    "\n" +
                    "【创新特色系统】\n" +
                    "女武神、羽翼等全新特色。\n" +
                    "DKP竞拍设置竞拍更自由化。\n" +
                    "3D无锁定、全方位视角畅享",

            "【FIFPro正版授权】\n" +
                    "\n" +
                    "可使用英超、西甲等全球63个国家几百个球队60000名球员的「真实信息」；\n" +
                    "\n" +
                    "【3D足球经营策略手游】\n" +
                    "\n" +
                    "模拟经营＆战术制定 养成球友＆搞遍天下\n" +
                    "\n" +
                    "不会告诉你跟《足球经理》一样可以gang队员；\n" +
                    "\n" +
                    "【瓜迪奥拉担任全球推广大使】\n" +
                    "\n" +
                    "不认识这号人的我也不解释，只要知道这货在足球界很牛逼就行；\n" +
                    "\n" +
                    "【专注于足球GAME制作的团队（♂）】\n" +
                    "\n" +
                    "其中有10个老司机，据称开车经验极其丰富，具体车（kou）技如何等这车造好了一试便知；\n" +
                    "\n" +
                    "【关键词：真实、深度、情感、操作性和交互式】\n" +
                    "\n" +
                    "实时对战玩法，实时验算球员及对抗数据，也就是说，你可以随时随地带领被你gang过的球队与另一名player隔着屏幕基情互射。",

            "这游戏最大的乐趣无疑是剧情的幽默，同时连人物的语音也是自带喜感的，这也可算对得起它的逗所在。\n" +
                    "\n" +
                    "玩法。推图的模式很像王者的冒险模式，而竞技场也跟王者如出一辙，都是直接上英雄，英雄自己来打，只要考虑战力和搭配就行了。玩法虽然差不多，但这游戏的游戏特效还是可以的。\n" +
                    "\n" +
                    "肝与氪。游戏开始推图还是比较快的，为了解锁更多功能，要不断升级推图升级，当然你也能对前面关卡扫荡来获取经验。总体来说，一开始比较肝，但后面卡图后，就可以轻松不少了。基本都是靠扫荡前面关卡升级。而一些日常做得也算轻松。这些都问题不大，毕竟战力和英雄才是最主要的。这就要说到游戏的氪金层面了，游戏有很多窗口都是来吸引氪金的。不氪金也能玩，但要肝不少工夫，如果要氪，建议氪个6元首充，这个性价比很高，能带来不少帮助，就当支持一下游戏也不错。",

            "1.皇子系统：从小皇子到皇上，让你感受不断皇子成长的乐趣。\n" +
                    "2.门客系统：数十位朝中赫赫有名之士悉数登场。\n" +
                    "3.升级系统：多种升级方式提升门客属性。\n" +
                    "4.任务系统：多样的任务系统，让你的升官之路永不枯燥。\n" +
                    "5.关卡系统：引人入胜的关卡剧情，让你乐在其中。\n" +
                    "6.联盟系统：多人互动一起打天下，联盟团战谁与争锋！",

            "《金球制胜》一款简单好玩的体育类闯关游戏，简单易上手，练习判断力和反应能力。\n" +
                    "游戏过程中，玩家需要控制队员，点击屏幕通过传球进行闯关，同时还需要预判队友的走位。\n" +
                    "游戏目前一共有70关，每一关难度越往上越增加。通过当前关卡后，才可以解锁下一关卡难度。\n" +
                    "通关结束后除了获得金币奖励外，达成相应条件还会获得奖杯。每个关卡最多可以获得3个奖杯，但是关卡不同，奖杯获得条件也会不同哦~"
    };
}
